diff --git a/.pre-commit-config.yaml b/.pre-commit-config.yaml
index ff08c7583fc..19259c069d7 100644
--- a/.pre-commit-config.yaml
+++ b/.pre-commit-config.yaml
@@ -1,7 +1,11 @@
 repos:
   - repo: https://github.com/astral-sh/ruff-pre-commit
-    rev: a27a2e47c7751b639d2b5badf0ef6ff11fee893f  # frozen: v0.15.4
+    rev: v0.13.2
     hooks:
+      - id: ruff-check
+        name: Run Ruff (lint) on Apple/
+        args: [--exit-non-zero-on-fix, --config=Apple/.ruff.toml]
+        files: ^Apple/
       - id: ruff-check
         name: Run Ruff (lint) on Doc/
         args: [--exit-non-zero-on-fix]
@@ -26,47 +30,35 @@
         name: Run Ruff (lint) on Tools/wasm/
         args: [--exit-non-zero-on-fix, --config=Tools/wasm/.ruff.toml]
         files: ^Tools/wasm/
+      - id: ruff-format
+        name: Run Ruff (format) on Apple/
+        args: [--exit-non-zero-on-fix, --config=Apple/.ruff.toml]
+        files: ^Apple
       - id: ruff-format
         name: Run Ruff (format) on Doc/
-        args: [--exit-non-zero-on-fix]
+        args: [--check]
         files: ^Doc/
       - id: ruff-format
         name: Run Ruff (format) on Tools/wasm/
-        args: [--exit-non-zero-on-fix, --config=Tools/wasm/.ruff.toml]
+        args: [--check, --config=Tools/wasm/.ruff.toml]
         files: ^Tools/wasm/
 
   - repo: https://github.com/psf/black-pre-commit-mirror
-    rev: ea488cebbfd88a5f50b8bd95d5c829d0bb76feb8  # frozen: 26.1.0
+    rev: 25.9.0
     hooks:
       - id: black

-if not os.getenv("READTHEDOCS"):
-    if language_code:
-        notfound_urls_prefix = (
-            f'/{language_code.replace("_", "-").lower()}/{version}/'
-        )
-    else:
-        notfound_urls_prefix = f'/{version}/'
-
 # Options for sphinxext-opengraph
 # -------------------------------
 
diff --git a/Doc/data/python3.13.abi b/Doc/data/python3.13.abi
index e0588167eba..619d84ae4ab 100644
--- a/Doc/data/python3.13.abi
+++ b/Doc/data/python3.13.abi
@@ -1143,7 +1143,6 @@
     <elf-symbol name='_PyEval_MatchClass' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyEval_MatchKeys' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyEval_MonitorRaise' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
-    <elf-symbol name='_PyEval_NoToolsForUnwind' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyEval_SetProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyEval_SliceIndex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyEval_SliceIndexNotNone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
@@ -1670,7 +1669,7 @@
     <elf-symbol name='_PyNotImplemented_Type' size='416' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyOS_ReadlineTState' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyParser_TokenNames' size='536' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
-    <elf-symbol name='_PyRuntime' size='283408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
+    <elf-symbol name='_PyRuntime' size='283376' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PySet_Dummy' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyUnion_Type' size='416' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_PyWeakref_CallableProxyType' size='416' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
@@ -1688,7 +1687,7 @@
     <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
   </elf-variable-symbols>
-  <abi-instr address-size='64' path='./Modules/_abc.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_abc.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyType_SetFlags' filepath='./Include/internal/pycore_typeobject.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-1'/>
       <parameter type-id='type-id-2'/>
@@ -1703,7 +1702,7 @@
     </function-decl>
     <type-decl name='unsigned long int' size-in-bits='64' id='type-id-2'/>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_codecsmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_codecsmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyUnicode_EncodeUTF7' filepath='./Include/internal/pycore_unicodeobject.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-5'/>
@@ -1737,10 +1736,10 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_io/_iomodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_io/_iomodule.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='_PyIO_Module' type-id='type-id-9' visibility='default' filepath='./Modules/_io/_iomodule.h' line='143' column='1'/>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_io/bufferedio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_io/bufferedio.c' comp-dir-path='/src' language='LANG_C11'>
     <typedef-decl name='_PyIO_State' type-id='type-id-10' filepath='./Modules/_io/_iomodule.h' line='35' column='1' id='type-id-11'/>
     <typedef-decl name='Py_off_t' type-id='type-id-12' filepath='./Modules/_io/_iomodule.h' line='109' column='1' id='type-id-13'/>
     <class-decl name='_io_state' size-in-bits='1024' is-struct='yes' visibility='default' filepath='./Modules/_io/_iomodule.h' line='145' column='1' id='type-id-10'>
@@ -1828,11 +1827,11 @@
       <return type-id='type-id-13'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_io/bytesio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_io/bytesio.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='bytesio_spec' type-id='type-id-16' visibility='default' filepath='./Modules/_io/_iomodule.h' line='17' column='1'/>
     <var-decl name='bytesiobuf_spec' type-id='type-id-16' visibility='default' filepath='./Modules/_io/_iomodule.h' line='18' column='1'/>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_io/fileio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_io/fileio.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='fileio_spec' type-id='type-id-16' visibility='default' filepath='./Modules/_io/_iomodule.h' line='19' column='1'/>
     <function-decl name='_PyIOBase_finalize' filepath='./Modules/_io/_iomodule.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
@@ -1844,14 +1843,14 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_io/iobase.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_io/iobase.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='iobase_spec' type-id='type-id-16' visibility='default' filepath='./Modules/_io/_iomodule.h' line='20' column='1'/>
     <var-decl name='rawiobase_spec' type-id='type-id-16' visibility='default' filepath='./Modules/_io/_iomodule.h' line='22' column='1'/>
     <function-decl name='_PyIO_trap_eintr' filepath='./Modules/_io/_iomodule.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_io/stringio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_io/stringio.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='stringio_spec' type-id='type-id-16' visibility='default' filepath='./Modules/_io/_iomodule.h' line='23' column='1'/>
     <function-decl name='_PyIncrementalNewlineDecoder_decode' filepath='./Modules/_io/_iomodule.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
@@ -1870,7 +1869,7 @@
       <return type-id='type-id-7'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_io/textio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_io/textio.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyCodec_LookupTextEncoding' filepath='./Include/internal/pycore_codecs.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-6'/>
       <parameter type-id='type-id-6'/>
@@ -1898,7 +1897,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_localemodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_localemodule.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='gettext' filepath='/usr/include/libintl.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-6'/>
       <return type-id='type-id-17'/>
@@ -1940,7 +1939,7 @@
       <return type-id='type-id-21'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_sre/sre.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_sre/sre.c' comp-dir-path='/src' language='LANG_C11'>
     <qualified-type-def type-id='type-id-22' const='yes' id='type-id-23'/>
     <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
     <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
@@ -1957,7 +1956,7 @@
     </function-decl>
     <type-decl name='unsigned short int' size-in-bits='16' id='type-id-22'/>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_threadmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_threadmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyMutex_TryUnlock' filepath='./Include/internal/pycore_lock.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-26'/>
       <return type-id='type-id-5'/>
@@ -1974,7 +1973,7 @@
       <return type-id='type-id-3'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_tracemalloc.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_tracemalloc.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyTraceMalloc_IsTracing' filepath='./Include/internal/pycore_tracemalloc.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-5'/>
     </function-decl>
@@ -2001,13 +2000,13 @@
       <return type-id='type-id-3'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/_weakref.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/_weakref.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyWeakref_GetWeakrefCount' filepath='./Include/internal/pycore_weakref.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-7'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/atexitmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/atexitmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='PyUnstable_AtExit' mangled-name='PyUnstable_AtExit' filepath='./Modules/atexitmodule.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_AtExit'>
       <parameter type-id='type-id-28' name='interp' filepath='./Modules/atexitmodule.c' line='27' column='1'/>
       <parameter type-id='type-id-29' name='func' filepath='./Modules/atexitmodule.c' line='28' column='1'/>
@@ -2015,7 +2014,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/faulthandler.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/faulthandler.c' comp-dir-path='/src' language='LANG_C11'>
     <enum-decl name='__rlimit_resource' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='31' column='1' id='type-id-31'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='RLIMIT_CPU' value='0'/>
@@ -2100,7 +2099,7 @@
       <return type-id='type-id-2'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/src' language='LANG_C11'>
     <type-decl name='char' size-in-bits='8' id='type-id-53'/>
     <type-decl name='int' size-in-bits='32' id='type-id-5'/>
     <type-decl name='unsigned long int' size-in-bits='64' id='type-id-2'/>
@@ -2125,7 +2124,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/getpath.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/getpath.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_Py_wfopen' filepath='./Include/internal/pycore_fileutils.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-18'/>
       <parameter type-id='type-id-18'/>
@@ -2164,7 +2163,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/posixmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/posixmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-62' size-in-bits='1024' id='type-id-63'>
       <subrange length='16' type-id='type-id-2' id='type-id-64'/>
     </array-type-def>
@@ -2459,7 +2458,7 @@
       <parameter type-id='type-id-27'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='_PyPerfTrampoline_AfterFork_Child' filepath='./Include/internal/pycore_ceval.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyPerfTrampoline_AfterFork_Child' filepath='./Include/internal/pycore_ceval.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-61'/>
     </function-decl>
     <function-decl name='_Py_device_encoding' filepath='./Include/internal/pycore_fileutils.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -3393,7 +3392,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/pwdmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/pwdmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='passwd' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/pwd.h' line='49' column='1' id='type-id-188'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='pw_name' type-id='type-id-17' visibility='default' filepath='/usr/include/pwd.h' line='51' column='1'/>
@@ -3447,7 +3446,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/signalmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/signalmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <enum-decl name='__itimer_which' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='114' column='1' id='type-id-193'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='ITIMER_REAL' value='0'/>
@@ -3486,20 +3485,20 @@
       <parameter type-id='type-id-5' name='fd' filepath='./Modules/signalmodule.c' line='833' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyErr_SetInterruptEx' mangled-name='PyErr_SetInterruptEx' filepath='./Modules/signalmodule.c' line='1894' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterruptEx'>
-      <parameter type-id='type-id-5' name='signum' filepath='./Modules/signalmodule.c' line='1894' column='1'/>
+    <function-decl name='PyErr_SetInterruptEx' mangled-name='PyErr_SetInterruptEx' filepath='./Modules/signalmodule.c' line='1888' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterruptEx'>
+      <parameter type-id='type-id-5' name='signum' filepath='./Modules/signalmodule.c' line='1888' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='./Modules/signalmodule.c' line='1910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
+    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='./Modules/signalmodule.c' line='1904' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_Py_RestoreSignals' mangled-name='_Py_RestoreSignals' filepath='./Modules/signalmodule.c' line='1948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_RestoreSignals'>
+    <function-decl name='_Py_RestoreSignals' mangled-name='_Py_RestoreSignals' filepath='./Modules/signalmodule.c' line='1942' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_RestoreSignals'>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='./Modules/signalmodule.c' line='2020' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
+    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='./Modules/signalmodule.c' line='2014' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='./Modules/signalmodule.c' line='2053' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
+    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='./Modules/signalmodule.c' line='2047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
       <return type-id='type-id-5'/>
     </function-decl>
     <function-decl name='sigismember' filepath='/usr/include/signal.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -3558,7 +3557,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/symtablemodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/symtablemodule.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_Py_SymtableStringObjectFlags' filepath='./Include/internal/pycore_symtable.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-6'/>
       <parameter type-id='type-id-4'/>
@@ -3567,7 +3566,7 @@
       <return type-id='type-id-207'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Modules/timemodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Modules/timemodule.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='_PyTimeFraction' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_time.h' line='310' column='1' id='type-id-209'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='numer' type-id='type-id-210' visibility='default' filepath='./Include/internal/pycore_time.h' line='311' column='1'/>
@@ -3653,7 +3652,7 @@
       <return type-id='type-id-21'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Python/dynload_shlib.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Python/dynload_shlib.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='256' id='type-id-225'>
       <subrange length='4' type-id='type-id-2' id='type-id-226'/>
     </array-type-def>
@@ -3675,12 +3674,12 @@
       <return type-id='type-id-17'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Python/getplatform.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Python/getplatform.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='Py_GetPlatform' mangled-name='Py_GetPlatform' filepath='./Python/getplatform.c' line='9' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPlatform'>
       <return type-id='type-id-6'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='./Python/importdl.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Python/importdl.c' comp-dir-path='/src' language='LANG_C11'>
     <typedef-decl name='dl_funcptr' type-id='type-id-230' filepath='./Include/internal/pycore_importdl.h' line='132' column='1' id='type-id-231'/>
     <function-decl name='_PyImport_SwapPackageContext' filepath='./Include/internal/pycore_import.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-6'/>
@@ -3697,7 +3696,7 @@
       <return type-id='type-id-3'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='./Python/sysmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='./Python/sysmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyEval_SetSwitchInterval' filepath='./Include/internal/pycore_ceval.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-2'/>
       <return type-id='type-id-3'/>
@@ -3735,7 +3734,7 @@
       <parameter type-id='type-id-233'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_PyIsPerfTrampolineActive' filepath='./Include/internal/pycore_ceval.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyIsPerfTrampolineActive' filepath='./Include/internal/pycore_ceval.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-5'/>
     </function-decl>
     <function-decl name='_PyDict_GetItemWithError' filepath='./Include/internal/pycore_dict.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -3843,52 +3842,52 @@
       <parameter type-id='type-id-6' name='parent_filename' filepath='./Python/sysmodule.c' line='2598' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PySys_ResetWarnOptions' mangled-name='PySys_ResetWarnOptions' filepath='./Python/sysmodule.c' line='2922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_ResetWarnOptions'>
+    <function-decl name='PySys_ResetWarnOptions' mangled-name='PySys_ResetWarnOptions' filepath='./Python/sysmodule.c' line='2911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_ResetWarnOptions'>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_AddWarnOptionUnicode' mangled-name='PySys_AddWarnOptionUnicode' filepath='./Python/sysmodule.c' line='2959' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOptionUnicode'>
-      <parameter type-id='type-id-4' name='option' filepath='./Python/sysmodule.c' line='2959' column='1'/>
+    <function-decl name='PySys_AddWarnOptionUnicode' mangled-name='PySys_AddWarnOptionUnicode' filepath='./Python/sysmodule.c' line='2948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOptionUnicode'>
+      <parameter type-id='type-id-4' name='option' filepath='./Python/sysmodule.c' line='2948' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_AddWarnOption' mangled-name='PySys_AddWarnOption' filepath='./Python/sysmodule.c' line='2972' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOption'>
-      <parameter type-id='type-id-18' name='s' filepath='./Python/sysmodule.c' line='2972' column='1'/>
+    <function-decl name='PySys_AddWarnOption' mangled-name='PySys_AddWarnOption' filepath='./Python/sysmodule.c' line='2961' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOption'>
+      <parameter type-id='type-id-18' name='s' filepath='./Python/sysmodule.c' line='2961' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_HasWarnOptions' mangled-name='PySys_HasWarnOptions' filepath='./Python/sysmodule.c' line='2992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_HasWarnOptions'>
+    <function-decl name='PySys_HasWarnOptions' mangled-name='PySys_HasWarnOptions' filepath='./Python/sysmodule.c' line='2981' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_HasWarnOptions'>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PySys_AddXOption' mangled-name='PySys_AddXOption' filepath='./Python/sysmodule.c' line='3082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddXOption'>
-      <parameter type-id='type-id-18' name='s' filepath='./Python/sysmodule.c' line='3082' column='1'/>
+    <function-decl name='PySys_AddXOption' mangled-name='PySys_AddXOption' filepath='./Python/sysmodule.c' line='3071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddXOption'>
+      <parameter type-id='type-id-18' name='s' filepath='./Python/sysmodule.c' line='3071' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_GetXOptions' mangled-name='PySys_GetXOptions' filepath='./Python/sysmodule.c' line='3096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetXOptions'>
+    <function-decl name='PySys_GetXOptions' mangled-name='PySys_GetXOptions' filepath='./Python/sysmodule.c' line='3085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetXOptions'>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_Py_CreateMonitoringObject' filepath='./Python/sysmodule.c' line='3888' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_Py_CreateMonitoringObject' filepath='./Python/sysmodule.c' line='3877' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PySys_SetPath' mangled-name='PySys_SetPath' filepath='./Python/sysmodule.c' line='4014' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetPath'>
-      <parameter type-id='type-id-18' name='path' filepath='./Python/sysmodule.c' line='4014' column='1'/>
+    <function-decl name='PySys_SetPath' mangled-name='PySys_SetPath' filepath='./Python/sysmodule.c' line='4003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetPath'>
+      <parameter type-id='type-id-18' name='path' filepath='./Python/sysmodule.c' line='4003' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_SetArgvEx' mangled-name='PySys_SetArgvEx' filepath='./Python/sysmodule.c' line='4046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgvEx'>
-      <parameter type-id='type-id-5' name='argc' filepath='./Python/sysmodule.c' line='4046' column='1'/>
-      <parameter type-id='type-id-238' name='argv' filepath='./Python/sysmodule.c' line='4046' column='1'/>
-      <parameter type-id='type-id-5' name='updatepath' filepath='./Python/sysmodule.c' line='4046' column='1'/>
+    <function-decl name='PySys_SetArgvEx' mangled-name='PySys_SetArgvEx' filepath='./Python/sysmodule.c' line='4035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgvEx'>
+      <parameter type-id='type-id-5' name='argc' filepath='./Python/sysmodule.c' line='4035' column='1'/>
+      <parameter type-id='type-id-238' name='argv' filepath='./Python/sysmodule.c' line='4035' column='1'/>
+      <parameter type-id='type-id-5' name='updatepath' filepath='./Python/sysmodule.c' line='4035' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_SetArgv' mangled-name='PySys_SetArgv' filepath='./Python/sysmodule.c' line='4093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgv'>
-      <parameter type-id='type-id-5' name='argc' filepath='./Python/sysmodule.c' line='4093' column='1'/>
-      <parameter type-id='type-id-238' name='argv' filepath='./Python/sysmodule.c' line='4093' column='1'/>
+    <function-decl name='PySys_SetArgv' mangled-name='PySys_SetArgv' filepath='./Python/sysmodule.c' line='4082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgv'>
+      <parameter type-id='type-id-5' name='argc' filepath='./Python/sysmodule.c' line='4082' column='1'/>
+      <parameter type-id='type-id-238' name='argv' filepath='./Python/sysmodule.c' line='4082' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_WriteStdout' mangled-name='PySys_WriteStdout' filepath='./Python/sysmodule.c' line='4189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStdout'>
-      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='4189' column='1'/>
+    <function-decl name='PySys_WriteStdout' mangled-name='PySys_WriteStdout' filepath='./Python/sysmodule.c' line='4178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStdout'>
+      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='4178' column='1'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PySys_FormatStdout' mangled-name='PySys_FormatStdout' filepath='./Python/sysmodule.c' line='4232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStdout'>
-      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='4232' column='1'/>
+    <function-decl name='PySys_FormatStdout' mangled-name='PySys_FormatStdout' filepath='./Python/sysmodule.c' line='4221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStdout'>
+      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='4221' column='1'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-3'/>
     </function-decl>
@@ -3896,7 +3895,7 @@
       <return type-id='type-id-116'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Modules/config.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Modules/config.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='Modules/config.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit'>
       <return type-id='type-id-4'/>
     </function-decl>
@@ -3973,7 +3972,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Modules/gcmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Modules/gcmodule.c' comp-dir-path='/src' language='LANG_C11'>
     <enum-decl name='_PyGC_Reason' naming-typedef-id='type-id-239' filepath='./Include/internal/pycore_gc.h' line='161' column='1' id='type-id-240'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='_Py_GC_REASON_HEAP' value='0'/>
@@ -4010,7 +4009,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Modules/main.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Modules/main.c' comp-dir-path='/src' language='LANG_C11'>
     <qualified-type-def type-id='type-id-241' const='yes' id='type-id-242'/>
     <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
     <function-decl name='_PyImport_Fini2' filepath='./Include/internal/pycore_import.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -4070,7 +4069,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/abstract.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/abstract.c' comp-dir-path='/src' language='LANG_C11'>
     <typedef-decl name='_Py_simple_func' type-id='type-id-246' filepath='./Include/internal/pycore_crossinterp.h' line='26' column='1' id='type-id-247'/>
     <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
     <qualified-type-def type-id='type-id-250' const='yes' id='type-id-251'/>
@@ -4103,7 +4102,7 @@
       <parameter type-id='type-id-5'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyErr_FormatUnraisable' mangled-name='PyErr_FormatUnraisable' filepath='./Include/cpython/pyerrors.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_FormatUnraisable'>
+    <function-decl name='PyErr_FormatUnraisable' mangled-name='PyErr_FormatUnraisable' filepath='./Include/cpython/pyerrors.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_FormatUnraisable'>
       <parameter type-id='type-id-6'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-3'/>
@@ -4145,7 +4144,7 @@
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_Py_CheckRecursiveCall' mangled-name='_Py_CheckRecursiveCall' filepath='./Include/internal/pycore_ceval.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckRecursiveCall'>
+    <function-decl name='_Py_CheckRecursiveCall' mangled-name='_Py_CheckRecursiveCall' filepath='./Include/internal/pycore_ceval.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckRecursiveCall'>
       <parameter type-id='type-id-27'/>
       <parameter type-id='type-id-6'/>
       <return type-id='type-id-5'/>
@@ -4817,7 +4816,7 @@
       <return type-id='type-id-5'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/boolobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/boolobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='_Py_FalseStruct' type-id='type-id-248' mangled-name='_Py_FalseStruct' visibility='default' filepath='./Include/boolobject.h' line='17' column='1' elf-symbol-id='_Py_FalseStruct'/>
     <var-decl name='_Py_TrueStruct' type-id='type-id-248' mangled-name='_Py_TrueStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_TrueStruct'/>
     <function-decl name='_PyArg_NoKwnames' filepath='./Include/internal/pycore_modsupport.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -4855,7 +4854,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/bytearrayobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/bytearrayobject.c' comp-dir-path='/src' language='LANG_C11'>
     <qualified-type-def type-id='type-id-264' const='yes' id='type-id-265'/>
     <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-266'/>
     <qualified-type-def type-id='type-id-5' const='yes' id='type-id-267'/>
@@ -5175,35 +5174,35 @@
       <parameter type-id='type-id-21'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='Objects/bytearrayobject.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
-      <parameter type-id='type-id-4' name='input' filepath='Objects/bytearrayobject.c' line='101' column='1'/>
+    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='Objects/bytearrayobject.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
+      <parameter type-id='type-id-4' name='input' filepath='Objects/bytearrayobject.c' line='83' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='Objects/bytearrayobject.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
-      <parameter type-id='type-id-6' name='bytes' filepath='Objects/bytearrayobject.c' line='127' column='1'/>
-      <parameter type-id='type-id-7' name='size' filepath='Objects/bytearrayobject.c' line='127' column='1'/>
+    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='Objects/bytearrayobject.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
+      <parameter type-id='type-id-6' name='bytes' filepath='Objects/bytearrayobject.c' line='109' column='1'/>
+      <parameter type-id='type-id-7' name='size' filepath='Objects/bytearrayobject.c' line='109' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='Objects/bytearrayobject.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
-      <parameter type-id='type-id-4' name='self' filepath='Objects/bytearrayobject.c' line='171' column='1'/>
+    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='Objects/bytearrayobject.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
+      <parameter type-id='type-id-4' name='self' filepath='Objects/bytearrayobject.c' line='153' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='Objects/bytearrayobject.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
-      <parameter type-id='type-id-4' name='self' filepath='Objects/bytearrayobject.c' line='180' column='1'/>
+    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='Objects/bytearrayobject.c' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
+      <parameter type-id='type-id-4' name='self' filepath='Objects/bytearrayobject.c' line='162' column='1'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='Objects/bytearrayobject.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
-      <parameter type-id='type-id-4' name='self' filepath='Objects/bytearrayobject.c' line='189' column='1'/>
-      <parameter type-id='type-id-7' name='requested_size' filepath='Objects/bytearrayobject.c' line='189' column='1'/>
+    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='Objects/bytearrayobject.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
+      <parameter type-id='type-id-4' name='self' filepath='Objects/bytearrayobject.c' line='171' column='1'/>
+      <parameter type-id='type-id-7' name='requested_size' filepath='Objects/bytearrayobject.c' line='171' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='Objects/bytearrayobject.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
-      <parameter type-id='type-id-4' name='a' filepath='Objects/bytearrayobject.c' line='268' column='1'/>
-      <parameter type-id='type-id-4' name='b' filepath='Objects/bytearrayobject.c' line='268' column='1'/>
+    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='Objects/bytearrayobject.c' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
+      <parameter type-id='type-id-4' name='a' filepath='Objects/bytearrayobject.c' line='250' column='1'/>
+      <parameter type-id='type-id-4' name='b' filepath='Objects/bytearrayobject.c' line='250' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/bytes_methods.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/bytes_methods.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='984' id='type-id-270'>
       <subrange length='123' type-id='type-id-2' id='type-id-271'/>
     </array-type-def>
@@ -5261,7 +5260,7 @@
       <return type-id='type-id-30'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/bytesobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/bytesobject.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='4096' id='type-id-293'>
       <subrange length='512' type-id='type-id-2' id='type-id-294'/>
     </array-type-def>
@@ -5368,100 +5367,100 @@
       <parameter is-variadic='yes'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_DecodeEscape'>
-      <parameter type-id='type-id-6' name='s' filepath='Objects/bytesobject.c' line='1189' column='1'/>
-      <parameter type-id='type-id-7' name='len' filepath='Objects/bytesobject.c' line='1190' column='1'/>
-      <parameter type-id='type-id-6' name='errors' filepath='Objects/bytesobject.c' line='1191' column='1'/>
-      <parameter type-id='type-id-258' name='first_invalid_escape' filepath='Objects/bytesobject.c' line='1192' column='1'/>
+    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_DecodeEscape'>
+      <parameter type-id='type-id-6' name='s' filepath='Objects/bytesobject.c' line='1187' column='1'/>
+      <parameter type-id='type-id-7' name='len' filepath='Objects/bytesobject.c' line='1188' column='1'/>
+      <parameter type-id='type-id-6' name='errors' filepath='Objects/bytesobject.c' line='1189' column='1'/>
+      <parameter type-id='type-id-258' name='first_invalid_escape' filepath='Objects/bytesobject.c' line='1190' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyBytes_DecodeEscape' mangled-name='PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_DecodeEscape'>
-      <parameter type-id='type-id-6' name='s' filepath='Objects/bytesobject.c' line='1201' column='1'/>
-      <parameter type-id='type-id-7' name='len' filepath='Objects/bytesobject.c' line='1202' column='1'/>
-      <parameter type-id='type-id-6' name='errors' filepath='Objects/bytesobject.c' line='1203' column='1'/>
-      <parameter type-id='type-id-7' name='_unused_unicode' filepath='Objects/bytesobject.c' line='1204' column='1'/>
-      <parameter type-id='type-id-6' name='_unused_recode_encoding' filepath='Objects/bytesobject.c' line='1205' column='1'/>
+    <function-decl name='PyBytes_DecodeEscape' mangled-name='PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_DecodeEscape'>
+      <parameter type-id='type-id-6' name='s' filepath='Objects/bytesobject.c' line='1199' column='1'/>
+      <parameter type-id='type-id-7' name='len' filepath='Objects/bytesobject.c' line='1200' column='1'/>
+      <parameter type-id='type-id-6' name='errors' filepath='Objects/bytesobject.c' line='1201' column='1'/>
+      <parameter type-id='type-id-7' name='_unused_unicode' filepath='Objects/bytesobject.c' line='1202' column='1'/>
+      <parameter type-id='type-id-6' name='_unused_recode_encoding' filepath='Objects/bytesobject.c' line='1203' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyBytes_Find' mangled-name='_PyBytes_Find' filepath='Objects/bytesobject.c' line='1310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Find'>
-      <parameter type-id='type-id-6' name='haystack' filepath='Objects/bytesobject.c' line='1310' column='1'/>
-      <parameter type-id='type-id-7' name='len_haystack' filepath='Objects/bytesobject.c' line='1310' column='1'/>
-      <parameter type-id='type-id-6' name='needle' filepath='Objects/bytesobject.c' line='1311' column='1'/>
-      <parameter type-id='type-id-7' name='len_needle' filepath='Objects/bytesobject.c' line='1311' column='1'/>
-      <parameter type-id='type-id-7' name='offset' filepath='Objects/bytesobject.c' line='1312' column='1'/>
+    <function-decl name='_PyBytes_Find' mangled-name='_PyBytes_Find' filepath='Objects/bytesobject.c' line='1308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Find'>
+      <parameter type-id='type-id-6' name='haystack' filepath='Objects/bytesobject.c' line='1308' column='1'/>
+      <parameter type-id='type-id-7' name='len_haystack' filepath='Objects/bytesobject.c' line='1308' column='1'/>
+      <parameter type-id='type-id-6' name='needle' filepath='Objects/bytesobject.c' line='1309' column='1'/>
+      <parameter type-id='type-id-7' name='len_needle' filepath='Objects/bytesobject.c' line='1309' column='1'/>
+      <parameter type-id='type-id-7' name='offset' filepath='Objects/bytesobject.c' line='1310' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='_PyBytes_ReverseFind' mangled-name='_PyBytes_ReverseFind' filepath='Objects/bytesobject.c' line='1336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_ReverseFind'>
-      <parameter type-id='type-id-6' name='haystack' filepath='Objects/bytesobject.c' line='1336' column='1'/>
-      <parameter type-id='type-id-7' name='len_haystack' filepath='Objects/bytesobject.c' line='1336' column='1'/>
-      <parameter type-id='type-id-6' name='needle' filepath='Objects/bytesobject.c' line='1337' column='1'/>
-      <parameter type-id='type-id-7' name='len_needle' filepath='Objects/bytesobject.c' line='1337' column='1'/>
-      <parameter type-id='type-id-7' name='offset' filepath='Objects/bytesobject.c' line='1338' column='1'/>
+    <function-decl name='_PyBytes_ReverseFind' mangled-name='_PyBytes_ReverseFind' filepath='Objects/bytesobject.c' line='1334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_ReverseFind'>
+      <parameter type-id='type-id-6' name='haystack' filepath='Objects/bytesobject.c' line='1334' column='1'/>
+      <parameter type-id='type-id-7' name='len_haystack' filepath='Objects/bytesobject.c' line='1334' column='1'/>
+      <parameter type-id='type-id-6' name='needle' filepath='Objects/bytesobject.c' line='1335' column='1'/>
+      <parameter type-id='type-id-7' name='len_needle' filepath='Objects/bytesobject.c' line='1335' column='1'/>
+      <parameter type-id='type-id-7' name='offset' filepath='Objects/bytesobject.c' line='1336' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='PyBytes_Repr' mangled-name='PyBytes_Repr' filepath='Objects/bytesobject.c' line='1345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Repr'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/bytesobject.c' line='1345' column='1'/>
-      <parameter type-id='type-id-5' name='smartquotes' filepath='Objects/bytesobject.c' line='1345' column='1'/>
+    <function-decl name='PyBytes_Repr' mangled-name='PyBytes_Repr' filepath='Objects/bytesobject.c' line='1343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Repr'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/bytesobject.c' line='1343' column='1'/>
+      <parameter type-id='type-id-5' name='smartquotes' filepath='Objects/bytesobject.c' line='1343' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyBytes_Join' mangled-name='_PyBytes_Join' filepath='Objects/bytesobject.c' line='1896' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Join'>
-      <parameter type-id='type-id-4' name='sep' filepath='Objects/bytesobject.c' line='1896' column='1'/>
-      <parameter type-id='type-id-4' name='x' filepath='Objects/bytesobject.c' line='1896' column='1'/>
+    <function-decl name='_PyBytes_Join' mangled-name='_PyBytes_Join' filepath='Objects/bytesobject.c' line='1894' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Join'>
+      <parameter type-id='type-id-4' name='sep' filepath='Objects/bytesobject.c' line='1894' column='1'/>
+      <parameter type-id='type-id-4' name='x' filepath='Objects/bytesobject.c' line='1894' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyBytes_FromObject' mangled-name='PyBytes_FromObject' filepath='Objects/bytesobject.c' line='2957' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromObject'>
-      <parameter type-id='type-id-4' name='x' filepath='Objects/bytesobject.c' line='2957' column='1'/>
+    <function-decl name='PyBytes_FromObject' mangled-name='PyBytes_FromObject' filepath='Objects/bytesobject.c' line='2955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromObject'>
+      <parameter type-id='type-id-4' name='x' filepath='Objects/bytesobject.c' line='2955' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='Objects/bytesobject.c' line='3142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel'>
-      <parameter type-id='type-id-235' name='pv' filepath='Objects/bytesobject.c' line='3142' column='1'/>
-      <parameter type-id='type-id-4' name='w' filepath='Objects/bytesobject.c' line='3142' column='1'/>
+    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='Objects/bytesobject.c' line='3140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel'>
+      <parameter type-id='type-id-235' name='pv' filepath='Objects/bytesobject.c' line='3140' column='1'/>
+      <parameter type-id='type-id-4' name='w' filepath='Objects/bytesobject.c' line='3140' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='Objects/bytesobject.c' line='3162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize'>
-      <parameter type-id='type-id-235' name='pv' filepath='Objects/bytesobject.c' line='3162' column='1'/>
-      <parameter type-id='type-id-7' name='newsize' filepath='Objects/bytesobject.c' line='3162' column='1'/>
+    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='Objects/bytesobject.c' line='3160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize'>
+      <parameter type-id='type-id-235' name='pv' filepath='Objects/bytesobject.c' line='3160' column='1'/>
+      <parameter type-id='type-id-7' name='newsize' filepath='Objects/bytesobject.c' line='3160' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyBytesWriter_Init' mangled-name='_PyBytesWriter_Init' filepath='Objects/bytesobject.c' line='3390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Init'>
-      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3390' column='1'/>
+    <function-decl name='_PyBytesWriter_Init' mangled-name='_PyBytesWriter_Init' filepath='Objects/bytesobject.c' line='3388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Init'>
+      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3388' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_PyBytesWriter_Dealloc' mangled-name='_PyBytesWriter_Dealloc' filepath='Objects/bytesobject.c' line='3401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Dealloc'>
-      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3401' column='1'/>
+    <function-decl name='_PyBytesWriter_Dealloc' mangled-name='_PyBytesWriter_Dealloc' filepath='Objects/bytesobject.c' line='3399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Dealloc'>
+      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3399' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_PyBytesWriter_Resize' mangled-name='_PyBytesWriter_Resize' filepath='Objects/bytesobject.c' line='3471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Resize'>
-      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3471' column='1'/>
-      <parameter type-id='type-id-30' name='str' filepath='Objects/bytesobject.c' line='3471' column='1'/>
-      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3471' column='1'/>
+    <function-decl name='_PyBytesWriter_Resize' mangled-name='_PyBytesWriter_Resize' filepath='Objects/bytesobject.c' line='3469' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Resize'>
+      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3469' column='1'/>
+      <parameter type-id='type-id-30' name='str' filepath='Objects/bytesobject.c' line='3469' column='1'/>
+      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3469' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='_PyBytesWriter_Prepare' mangled-name='_PyBytesWriter_Prepare' filepath='Objects/bytesobject.c' line='3541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Prepare'>
-      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3541' column='1'/>
-      <parameter type-id='type-id-30' name='str' filepath='Objects/bytesobject.c' line='3541' column='1'/>
-      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3541' column='1'/>
+    <function-decl name='_PyBytesWriter_Prepare' mangled-name='_PyBytesWriter_Prepare' filepath='Objects/bytesobject.c' line='3539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Prepare'>
+      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3539' column='1'/>
+      <parameter type-id='type-id-30' name='str' filepath='Objects/bytesobject.c' line='3539' column='1'/>
+      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3539' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='_PyBytesWriter_Alloc' mangled-name='_PyBytesWriter_Alloc' filepath='Objects/bytesobject.c' line='3571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Alloc'>
-      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3571' column='1'/>
-      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3571' column='1'/>
+    <function-decl name='_PyBytesWriter_Alloc' mangled-name='_PyBytesWriter_Alloc' filepath='Objects/bytesobject.c' line='3569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Alloc'>
+      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3569' column='1'/>
+      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3569' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='_PyBytesWriter_Finish' mangled-name='_PyBytesWriter_Finish' filepath='Objects/bytesobject.c' line='3601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Finish'>
-      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3601' column='1'/>
-      <parameter type-id='type-id-30' name='str' filepath='Objects/bytesobject.c' line='3601' column='1'/>
+    <function-decl name='_PyBytesWriter_Finish' mangled-name='_PyBytesWriter_Finish' filepath='Objects/bytesobject.c' line='3599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Finish'>
+      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3599' column='1'/>
+      <parameter type-id='type-id-30' name='str' filepath='Objects/bytesobject.c' line='3599' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyBytesWriter_WriteBytes' mangled-name='_PyBytesWriter_WriteBytes' filepath='Objects/bytesobject.c' line='3645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_WriteBytes'>
-      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3645' column='1'/>
-      <parameter type-id='type-id-30' name='ptr' filepath='Objects/bytesobject.c' line='3645' column='1'/>
-      <parameter type-id='type-id-30' name='bytes' filepath='Objects/bytesobject.c' line='3646' column='1'/>
-      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3646' column='1'/>
+    <function-decl name='_PyBytesWriter_WriteBytes' mangled-name='_PyBytesWriter_WriteBytes' filepath='Objects/bytesobject.c' line='3643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_WriteBytes'>
+      <parameter type-id='type-id-297' name='writer' filepath='Objects/bytesobject.c' line='3643' column='1'/>
+      <parameter type-id='type-id-30' name='ptr' filepath='Objects/bytesobject.c' line='3643' column='1'/>
+      <parameter type-id='type-id-30' name='bytes' filepath='Objects/bytesobject.c' line='3644' column='1'/>
+      <parameter type-id='type-id-7' name='size' filepath='Objects/bytesobject.c' line='3644' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/call.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/call.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='_Py_Identifier' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='38' column='1' id='type-id-300'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='string' type-id='type-id-6' visibility='default' filepath='./Include/cpython/object.h' line='39' column='1'/>
@@ -5480,7 +5479,7 @@
     </class-decl>
     <typedef-decl name='_Py_Identifier' type-id='type-id-300' filepath='./Include/cpython/object.h' line='47' column='1' id='type-id-303'/>
     <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-304'/>
-    <function-decl name='_PyObject_GetAttrId' mangled-name='_PyObject_GetAttrId' filepath='./Include/cpython/object.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GetAttrId'>
+    <function-decl name='_PyObject_GetAttrId' mangled-name='_PyObject_GetAttrId' filepath='./Include/cpython/object.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GetAttrId'>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-304'/>
       <return type-id='type-id-4'/>
@@ -5496,7 +5495,7 @@
       <parameter type-id='type-id-235'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyEval_Vector' filepath='./Include/internal/pycore_ceval.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyEval_Vector' filepath='./Include/internal/pycore_ceval.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-27'/>
       <parameter type-id='type-id-305'/>
       <parameter type-id='type-id-4'/>
@@ -5642,30 +5641,30 @@
       <parameter is-variadic='yes'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='Objects/call.c' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/call.c' line='741' column='1'/>
-      <parameter type-id='type-id-6' name='name' filepath='Objects/call.c' line='741' column='1'/>
-      <parameter type-id='type-id-6' name='format' filepath='Objects/call.c' line='742' column='1'/>
+    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='Objects/call.c' line='740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/call.c' line='740' column='1'/>
+      <parameter type-id='type-id-6' name='name' filepath='Objects/call.c' line='740' column='1'/>
+      <parameter type-id='type-id-6' name='format' filepath='Objects/call.c' line='741' column='1'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='Objects/call.c' line='865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/call.c' line='865' column='1'/>
-      <parameter type-id='type-id-4' name='name' filepath='Objects/call.c' line='865' column='1'/>
+    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='Objects/call.c' line='864' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/call.c' line='864' column='1'/>
+      <parameter type-id='type-id-4' name='name' filepath='Objects/call.c' line='864' column='1'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyStack_AsDict' mangled-name='_PyStack_AsDict' filepath='Objects/call.c' line='937' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_AsDict'>
-      <parameter type-id='type-id-255' name='values' filepath='Objects/call.c' line='937' column='1'/>
-      <parameter type-id='type-id-4' name='kwnames' filepath='Objects/call.c' line='937' column='1'/>
+    <function-decl name='_PyStack_AsDict' mangled-name='_PyStack_AsDict' filepath='Objects/call.c' line='936' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_AsDict'>
+      <parameter type-id='type-id-255' name='values' filepath='Objects/call.c' line='936' column='1'/>
+      <parameter type-id='type-id-4' name='kwnames' filepath='Objects/call.c' line='936' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyVectorcall_NARGS' mangled-name='PyVectorcall_NARGS' filepath='Objects/call.c' line='1050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyVectorcall_NARGS'>
-      <parameter type-id='type-id-21' name='n' filepath='Objects/call.c' line='1050' column='1'/>
+    <function-decl name='PyVectorcall_NARGS' mangled-name='PyVectorcall_NARGS' filepath='Objects/call.c' line='1049' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyVectorcall_NARGS'>
+      <parameter type-id='type-id-21' name='n' filepath='Objects/call.c' line='1049' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/capsule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/capsule.c' comp-dir-path='/src' language='LANG_C11'>
     <typedef-decl name='PyCapsule_Destructor' type-id='type-id-307' filepath='./Include/pycapsule.h' line='23' column='1' id='type-id-308'/>
     <function-decl name='PyImport_ImportModule' mangled-name='PyImport_ImportModule' filepath='./Include/import.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyImport_ImportModule'>
       <parameter type-id='type-id-6'/>
@@ -5740,7 +5739,7 @@
       <return type-id='type-id-3'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/cellobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/cellobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyCell_Type' type-id='type-id-263' mangled-name='PyCell_Type' visibility='default' filepath='./Include/cpython/cellobject.h' line='16' column='1' elf-symbol-id='PyCell_Type'/>
     <function-decl name='PyObject_RichCompare' mangled-name='PyObject_RichCompare' filepath='./Include/object.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_RichCompare'>
       <parameter type-id='type-id-4'/>
@@ -5762,10 +5761,10 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/classobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/classobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyMethod_Type' type-id='type-id-263' mangled-name='PyMethod_Type' visibility='default' filepath='./Include/cpython/classobject.h' line='20' column='1' elf-symbol-id='PyMethod_Type'/>
     <var-decl name='PyInstanceMethod_Type' type-id='type-id-263' mangled-name='PyInstanceMethod_Type' visibility='default' filepath='./Include/cpython/classobject.h' line='49' column='1' elf-symbol-id='PyInstanceMethod_Type'/>
-    <function-decl name='_PyType_LookupRef' mangled-name='_PyType_LookupRef' filepath='./Include/cpython/object.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_LookupRef'>
+    <function-decl name='_PyType_LookupRef' mangled-name='_PyType_LookupRef' filepath='./Include/cpython/object.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_LookupRef'>
       <parameter type-id='type-id-1'/>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-4'/>
@@ -5818,7 +5817,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/codeobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/codeobject.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='_opaque' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/cpython/code.h' line='285' column='1' id='type-id-312'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='computed_line' type-id='type-id-5' visibility='default' filepath='./Include/cpython/code.h' line='286' column='1'/>
@@ -5855,7 +5854,7 @@
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-321'/>
     </function-decl>
-    <function-decl name='_Py_GetBaseOpcode' filepath='./Include/internal/pycore_code.h' line='596' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_Py_GetBaseOpcode' filepath='./Include/internal/pycore_code.h' line='589' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-322'/>
       <parameter type-id='type-id-5'/>
       <return type-id='type-id-5'/>
@@ -5976,54 +5975,54 @@
       <parameter type-id='type-id-5' name='addrq' filepath='Objects/codeobject.c' line='986' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyCode_CheckLineNumber' mangled-name='_PyCode_CheckLineNumber' filepath='Objects/codeobject.c' line='1041' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_CheckLineNumber'>
-      <parameter type-id='type-id-5' name='lasti' filepath='Objects/codeobject.c' line='1041' column='1'/>
-      <parameter type-id='type-id-316' name='bounds' filepath='Objects/codeobject.c' line='1041' column='1'/>
+    <function-decl name='_PyCode_CheckLineNumber' mangled-name='_PyCode_CheckLineNumber' filepath='Objects/codeobject.c' line='1024' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_CheckLineNumber'>
+      <parameter type-id='type-id-5' name='lasti' filepath='Objects/codeobject.c' line='1024' column='1'/>
+      <parameter type-id='type-id-316' name='bounds' filepath='Objects/codeobject.c' line='1024' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyCode_Addr2Location' mangled-name='PyCode_Addr2Location' filepath='Objects/codeobject.c' line='1218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_Addr2Location'>
-      <parameter type-id='type-id-322' name='co' filepath='Objects/codeobject.c' line='1218' column='1'/>
-      <parameter type-id='type-id-5' name='addrq' filepath='Objects/codeobject.c' line='1218' column='1'/>
-      <parameter type-id='type-id-175' name='start_line' filepath='Objects/codeobject.c' line='1219' column='1'/>
-      <parameter type-id='type-id-175' name='start_column' filepath='Objects/codeobject.c' line='1219' column='1'/>
-      <parameter type-id='type-id-175' name='end_line' filepath='Objects/codeobject.c' line='1220' column='1'/>
-      <parameter type-id='type-id-175' name='end_column' filepath='Objects/codeobject.c' line='1220' column='1'/>
+    <function-decl name='PyCode_Addr2Location' mangled-name='PyCode_Addr2Location' filepath='Objects/codeobject.c' line='1201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_Addr2Location'>
+      <parameter type-id='type-id-322' name='co' filepath='Objects/codeobject.c' line='1201' column='1'/>
+      <parameter type-id='type-id-5' name='addrq' filepath='Objects/codeobject.c' line='1201' column='1'/>
+      <parameter type-id='type-id-175' name='start_line' filepath='Objects/codeobject.c' line='1202' column='1'/>
+      <parameter type-id='type-id-175' name='start_column' filepath='Objects/codeobject.c' line='1202' column='1'/>
+      <parameter type-id='type-id-175' name='end_line' filepath='Objects/codeobject.c' line='1203' column='1'/>
+      <parameter type-id='type-id-175' name='end_column' filepath='Objects/codeobject.c' line='1203' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnstable_Code_GetExtra' mangled-name='PyUnstable_Code_GetExtra' filepath='Objects/codeobject.c' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Code_GetExtra'>
-      <parameter type-id='type-id-4' name='code' filepath='Objects/codeobject.c' line='1539' column='1'/>
-      <parameter type-id='type-id-7' name='index' filepath='Objects/codeobject.c' line='1539' column='1'/>
-      <parameter type-id='type-id-259' name='extra' filepath='Objects/codeobject.c' line='1539' column='1'/>
+    <function-decl name='PyUnstable_Code_GetExtra' mangled-name='PyUnstable_Code_GetExtra' filepath='Objects/codeobject.c' line='1522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Code_GetExtra'>
+      <parameter type-id='type-id-4' name='code' filepath='Objects/codeobject.c' line='1522' column='1'/>
+      <parameter type-id='type-id-7' name='index' filepath='Objects/codeobject.c' line='1522' column='1'/>
+      <parameter type-id='type-id-259' name='extra' filepath='Objects/codeobject.c' line='1522' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnstable_Code_SetExtra' mangled-name='PyUnstable_Code_SetExtra' filepath='Objects/codeobject.c' line='1560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Code_SetExtra'>
-      <parameter type-id='type-id-4' name='code' filepath='Objects/codeobject.c' line='1560' column='1'/>
-      <parameter type-id='type-id-7' name='index' filepath='Objects/codeobject.c' line='1560' column='1'/>
-      <parameter type-id='type-id-30' name='extra' filepath='Objects/codeobject.c' line='1560' column='1'/>
+    <function-decl name='PyUnstable_Code_SetExtra' mangled-name='PyUnstable_Code_SetExtra' filepath='Objects/codeobject.c' line='1543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Code_SetExtra'>
+      <parameter type-id='type-id-4' name='code' filepath='Objects/codeobject.c' line='1543' column='1'/>
+      <parameter type-id='type-id-7' name='index' filepath='Objects/codeobject.c' line='1543' column='1'/>
+      <parameter type-id='type-id-30' name='extra' filepath='Objects/codeobject.c' line='1543' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyCode_GetVarnames' mangled-name='PyCode_GetVarnames' filepath='Objects/codeobject.c' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetVarnames'>
-      <parameter type-id='type-id-322' name='code' filepath='Objects/codeobject.c' line='1638' column='1'/>
+    <function-decl name='PyCode_GetVarnames' mangled-name='PyCode_GetVarnames' filepath='Objects/codeobject.c' line='1621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetVarnames'>
+      <parameter type-id='type-id-322' name='code' filepath='Objects/codeobject.c' line='1621' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyCode_GetCellvars' mangled-name='PyCode_GetCellvars' filepath='Objects/codeobject.c' line='1653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetCellvars'>
-      <parameter type-id='type-id-322' name='code' filepath='Objects/codeobject.c' line='1653' column='1'/>
+    <function-decl name='PyCode_GetCellvars' mangled-name='PyCode_GetCellvars' filepath='Objects/codeobject.c' line='1636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetCellvars'>
+      <parameter type-id='type-id-322' name='code' filepath='Objects/codeobject.c' line='1636' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyCode_GetFreevars' mangled-name='PyCode_GetFreevars' filepath='Objects/codeobject.c' line='1668' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetFreevars'>
-      <parameter type-id='type-id-322' name='code' filepath='Objects/codeobject.c' line='1668' column='1'/>
+    <function-decl name='PyCode_GetFreevars' mangled-name='PyCode_GetFreevars' filepath='Objects/codeobject.c' line='1651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetFreevars'>
+      <parameter type-id='type-id-322' name='code' filepath='Objects/codeobject.c' line='1651' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyCode_GetCode' mangled-name='PyCode_GetCode' filepath='Objects/codeobject.c' line='1747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetCode'>
-      <parameter type-id='type-id-322' name='co' filepath='Objects/codeobject.c' line='1747' column='1'/>
+    <function-decl name='PyCode_GetCode' mangled-name='PyCode_GetCode' filepath='Objects/codeobject.c' line='1730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_GetCode'>
+      <parameter type-id='type-id-322' name='co' filepath='Objects/codeobject.c' line='1730' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyCode_ConstantKey' mangled-name='_PyCode_ConstantKey' filepath='Objects/codeobject.c' line='2441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_ConstantKey'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/codeobject.c' line='2441' column='1'/>
+    <function-decl name='_PyCode_ConstantKey' mangled-name='_PyCode_ConstantKey' filepath='Objects/codeobject.c' line='2424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_ConstantKey'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/codeobject.c' line='2424' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/complexobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/complexobject.c' comp-dir-path='/src' language='LANG_C11'>
     <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
     <var-decl name='PyComplex_Type' type-id='type-id-263' mangled-name='PyComplex_Type' visibility='default' filepath='./Include/complexobject.h' line='11' column='1' elf-symbol-id='PyComplex_Type'/>
     <function-decl name='_Py_HashDouble' mangled-name='_Py_HashDouble' filepath='./Include/cpython/pyhash.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_HashDouble'>
@@ -6140,18 +6139,18 @@
       <return type-id='type-id-4'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/descrobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/descrobject.c' comp-dir-path='/src' language='LANG_C11'>
     <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
-    <function-decl name='_PyObject_FunctionStr' mangled-name='_PyObject_FunctionStr' filepath='./Include/cpython/object.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FunctionStr'>
+    <function-decl name='_PyObject_FunctionStr' mangled-name='_PyObject_FunctionStr' filepath='./Include/cpython/object.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FunctionStr'>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyTrash_thread_deposit_object' mangled-name='_PyTrash_thread_deposit_object' filepath='./Include/cpython/object.h' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTrash_thread_deposit_object'>
+    <function-decl name='_PyTrash_thread_deposit_object' mangled-name='_PyTrash_thread_deposit_object' filepath='./Include/cpython/object.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTrash_thread_deposit_object'>
       <parameter type-id='type-id-27'/>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_PyTrash_thread_destroy_chain' mangled-name='_PyTrash_thread_destroy_chain' filepath='./Include/cpython/object.h' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTrash_thread_destroy_chain'>
+    <function-decl name='_PyTrash_thread_destroy_chain' mangled-name='_PyTrash_thread_destroy_chain' filepath='./Include/cpython/object.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTrash_thread_destroy_chain'>
       <parameter type-id='type-id-27'/>
       <return type-id='type-id-3'/>
     </function-decl>
@@ -6282,8 +6281,8 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/dictobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
-    <function-decl name='_PyObject_AssertFailed' mangled-name='_PyObject_AssertFailed' filepath='./Include/cpython/object.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_AssertFailed'>
+  <abi-instr address-size='64' path='Objects/dictobject.c' comp-dir-path='/src' language='LANG_C11'>
+    <function-decl name='_PyObject_AssertFailed' mangled-name='_PyObject_AssertFailed' filepath='./Include/cpython/object.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_AssertFailed'>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-6'/>
       <parameter type-id='type-id-6'/>
@@ -6331,170 +6330,170 @@
     <function-decl name='PyInterpreterState_Get' mangled-name='PyInterpreterState_Get' filepath='./Include/pystate.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInterpreterState_Get'>
       <return type-id='type-id-28'/>
     </function-decl>
-    <function-decl name='_PyDict_NewPresized' mangled-name='_PyDict_NewPresized' filepath='Objects/dictobject.c' line='2185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_NewPresized'>
-      <parameter type-id='type-id-7' name='minused' filepath='Objects/dictobject.c' line='2185' column='1'/>
+    <function-decl name='_PyDict_NewPresized' mangled-name='_PyDict_NewPresized' filepath='Objects/dictobject.c' line='2176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_NewPresized'>
+      <parameter type-id='type-id-7' name='minused' filepath='Objects/dictobject.c' line='2176' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyDict_GetItem_KnownHash' mangled-name='_PyDict_GetItem_KnownHash' filepath='Objects/dictobject.c' line='2313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_GetItem_KnownHash'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2313' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2313' column='1'/>
-      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2313' column='1'/>
+    <function-decl name='_PyDict_GetItem_KnownHash' mangled-name='_PyDict_GetItem_KnownHash' filepath='Objects/dictobject.c' line='2304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_GetItem_KnownHash'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2304' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2304' column='1'/>
+      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2304' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyDict_GetItemRef_KnownHash_LockHeld' mangled-name='_PyDict_GetItemRef_KnownHash_LockHeld' filepath='Objects/dictobject.c' line='2339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_GetItemRef_KnownHash_LockHeld'>
-      <parameter type-id='type-id-332' name='op' filepath='Objects/dictobject.c' line='2339' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2339' column='1'/>
-      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2340' column='1'/>
-      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='2340' column='1'/>
+    <function-decl name='_PyDict_GetItemRef_KnownHash_LockHeld' mangled-name='_PyDict_GetItemRef_KnownHash_LockHeld' filepath='Objects/dictobject.c' line='2330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_GetItemRef_KnownHash_LockHeld'>
+      <parameter type-id='type-id-332' name='op' filepath='Objects/dictobject.c' line='2330' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2330' column='1'/>
+      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2331' column='1'/>
+      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='2331' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyDict_GetItemStringWithError' mangled-name='_PyDict_GetItemStringWithError' filepath='Objects/dictobject.c' line='2487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_GetItemStringWithError'>
-      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='2487' column='1'/>
-      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='2487' column='1'/>
+    <function-decl name='_PyDict_GetItemStringWithError' mangled-name='_PyDict_GetItemStringWithError' filepath='Objects/dictobject.c' line='2478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_GetItemStringWithError'>
+      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='2478' column='1'/>
+      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='2478' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyDict_LoadGlobal' mangled-name='_PyDict_LoadGlobal' filepath='Objects/dictobject.c' line='2512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_LoadGlobal'>
-      <parameter type-id='type-id-332' name='globals' filepath='Objects/dictobject.c' line='2512' column='1'/>
-      <parameter type-id='type-id-332' name='builtins' filepath='Objects/dictobject.c' line='2512' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2512' column='1'/>
+    <function-decl name='_PyDict_LoadGlobal' mangled-name='_PyDict_LoadGlobal' filepath='Objects/dictobject.c' line='2503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_LoadGlobal'>
+      <parameter type-id='type-id-332' name='globals' filepath='Objects/dictobject.c' line='2503' column='1'/>
+      <parameter type-id='type-id-332' name='builtins' filepath='Objects/dictobject.c' line='2503' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2503' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyDict_SetItem_Take2' mangled-name='_PyDict_SetItem_Take2' filepath='Objects/dictobject.c' line='2562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SetItem_Take2'>
-      <parameter type-id='type-id-332' name='mp' filepath='Objects/dictobject.c' line='2562' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2562' column='1'/>
-      <parameter type-id='type-id-4' name='value' filepath='Objects/dictobject.c' line='2562' column='1'/>
+    <function-decl name='_PyDict_SetItem_Take2' mangled-name='_PyDict_SetItem_Take2' filepath='Objects/dictobject.c' line='2553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SetItem_Take2'>
+      <parameter type-id='type-id-332' name='mp' filepath='Objects/dictobject.c' line='2553' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2553' column='1'/>
+      <parameter type-id='type-id-4' name='value' filepath='Objects/dictobject.c' line='2553' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyDict_SetItem_KnownHash_LockHeld' mangled-name='_PyDict_SetItem_KnownHash_LockHeld' filepath='Objects/dictobject.c' line='2601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SetItem_KnownHash_LockHeld'>
-      <parameter type-id='type-id-332' name='mp' filepath='Objects/dictobject.c' line='2601' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2601' column='1'/>
-      <parameter type-id='type-id-4' name='value' filepath='Objects/dictobject.c' line='2601' column='1'/>
-      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2602' column='1'/>
+    <function-decl name='_PyDict_SetItem_KnownHash_LockHeld' mangled-name='_PyDict_SetItem_KnownHash_LockHeld' filepath='Objects/dictobject.c' line='2592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SetItem_KnownHash_LockHeld'>
+      <parameter type-id='type-id-332' name='mp' filepath='Objects/dictobject.c' line='2592' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2592' column='1'/>
+      <parameter type-id='type-id-4' name='value' filepath='Objects/dictobject.c' line='2592' column='1'/>
+      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2593' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyDict_SetItem_KnownHash' mangled-name='_PyDict_SetItem_KnownHash' filepath='Objects/dictobject.c' line='2613' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SetItem_KnownHash'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2613' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2613' column='1'/>
-      <parameter type-id='type-id-4' name='value' filepath='Objects/dictobject.c' line='2613' column='1'/>
-      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2614' column='1'/>
+    <function-decl name='_PyDict_SetItem_KnownHash' mangled-name='_PyDict_SetItem_KnownHash' filepath='Objects/dictobject.c' line='2604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SetItem_KnownHash'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2604' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2604' column='1'/>
+      <parameter type-id='type-id-4' name='value' filepath='Objects/dictobject.c' line='2604' column='1'/>
+      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2605' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyDict_DelItem_KnownHash' mangled-name='_PyDict_DelItem_KnownHash' filepath='Objects/dictobject.c' line='2738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_DelItem_KnownHash'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2738' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2738' column='1'/>
-      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2738' column='1'/>
+    <function-decl name='_PyDict_DelItem_KnownHash' mangled-name='_PyDict_DelItem_KnownHash' filepath='Objects/dictobject.c' line='2729' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_DelItem_KnownHash'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2729' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2729' column='1'/>
+      <parameter type-id='type-id-298' name='hash' filepath='Objects/dictobject.c' line='2729' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyDict_DelItemIf' mangled-name='_PyDict_DelItemIf' filepath='Objects/dictobject.c' line='2793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_DelItemIf'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2793' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2793' column='1'/>
-      <parameter type-id='type-id-333' name='predicate' filepath='Objects/dictobject.c' line='2794' column='1'/>
-      <parameter type-id='type-id-30' name='arg' filepath='Objects/dictobject.c' line='2795' column='1'/>
+    <function-decl name='_PyDict_DelItemIf' mangled-name='_PyDict_DelItemIf' filepath='Objects/dictobject.c' line='2784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_DelItemIf'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2784' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='2784' column='1'/>
+      <parameter type-id='type-id-333' name='predicate' filepath='Objects/dictobject.c' line='2785' column='1'/>
+      <parameter type-id='type-id-30' name='arg' filepath='Objects/dictobject.c' line='2786' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_Clear' mangled-name='PyDict_Clear' filepath='Objects/dictobject.c' line='2868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Clear'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2868' column='1'/>
+    <function-decl name='PyDict_Clear' mangled-name='PyDict_Clear' filepath='Objects/dictobject.c' line='2846' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Clear'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='2846' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PyDict_PopString' mangled-name='PyDict_PopString' filepath='Objects/dictobject.c' line='3060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_PopString'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='3060' column='1'/>
-      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='3060' column='1'/>
-      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='3060' column='1'/>
+    <function-decl name='PyDict_PopString' mangled-name='PyDict_PopString' filepath='Objects/dictobject.c' line='3038' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_PopString'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='3038' column='1'/>
+      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='3038' column='1'/>
+      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='3038' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyDict_Pop' mangled-name='_PyDict_Pop' filepath='Objects/dictobject.c' line='3077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_Pop'>
-      <parameter type-id='type-id-4' name='dict' filepath='Objects/dictobject.c' line='3077' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='3077' column='1'/>
-      <parameter type-id='type-id-4' name='default_value' filepath='Objects/dictobject.c' line='3077' column='1'/>
+    <function-decl name='_PyDict_Pop' mangled-name='_PyDict_Pop' filepath='Objects/dictobject.c' line='3055' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_Pop'>
+      <parameter type-id='type-id-4' name='dict' filepath='Objects/dictobject.c' line='3055' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='3055' column='1'/>
+      <parameter type-id='type-id-4' name='default_value' filepath='Objects/dictobject.c' line='3055' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyDict_MergeFromSeq2' mangled-name='PyDict_MergeFromSeq2' filepath='Objects/dictobject.c' line='3739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_MergeFromSeq2'>
-      <parameter type-id='type-id-4' name='d' filepath='Objects/dictobject.c' line='3739' column='1'/>
-      <parameter type-id='type-id-4' name='seq2' filepath='Objects/dictobject.c' line='3739' column='1'/>
-      <parameter type-id='type-id-5' name='override' filepath='Objects/dictobject.c' line='3739' column='1'/>
+    <function-decl name='PyDict_MergeFromSeq2' mangled-name='PyDict_MergeFromSeq2' filepath='Objects/dictobject.c' line='3717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_MergeFromSeq2'>
+      <parameter type-id='type-id-4' name='d' filepath='Objects/dictobject.c' line='3717' column='1'/>
+      <parameter type-id='type-id-4' name='seq2' filepath='Objects/dictobject.c' line='3717' column='1'/>
+      <parameter type-id='type-id-5' name='override' filepath='Objects/dictobject.c' line='3717' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_Merge' mangled-name='PyDict_Merge' filepath='Objects/dictobject.c' line='3958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Merge'>
-      <parameter type-id='type-id-4' name='a' filepath='Objects/dictobject.c' line='3958' column='1'/>
-      <parameter type-id='type-id-4' name='b' filepath='Objects/dictobject.c' line='3958' column='1'/>
-      <parameter type-id='type-id-5' name='override' filepath='Objects/dictobject.c' line='3958' column='1'/>
+    <function-decl name='PyDict_Merge' mangled-name='PyDict_Merge' filepath='Objects/dictobject.c' line='3936' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Merge'>
+      <parameter type-id='type-id-4' name='a' filepath='Objects/dictobject.c' line='3936' column='1'/>
+      <parameter type-id='type-id-4' name='b' filepath='Objects/dictobject.c' line='3936' column='1'/>
+      <parameter type-id='type-id-5' name='override' filepath='Objects/dictobject.c' line='3936' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyDict_MergeEx' mangled-name='_PyDict_MergeEx' filepath='Objects/dictobject.c' line='3966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_MergeEx'>
-      <parameter type-id='type-id-4' name='a' filepath='Objects/dictobject.c' line='3966' column='1'/>
-      <parameter type-id='type-id-4' name='b' filepath='Objects/dictobject.c' line='3966' column='1'/>
-      <parameter type-id='type-id-5' name='override' filepath='Objects/dictobject.c' line='3966' column='1'/>
+    <function-decl name='_PyDict_MergeEx' mangled-name='_PyDict_MergeEx' filepath='Objects/dictobject.c' line='3944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_MergeEx'>
+      <parameter type-id='type-id-4' name='a' filepath='Objects/dictobject.c' line='3944' column='1'/>
+      <parameter type-id='type-id-4' name='b' filepath='Objects/dictobject.c' line='3944' column='1'/>
+      <parameter type-id='type-id-5' name='override' filepath='Objects/dictobject.c' line='3944' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_SetDefaultRef' mangled-name='PyDict_SetDefaultRef' filepath='Objects/dictobject.c' line='4374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_SetDefaultRef'>
-      <parameter type-id='type-id-4' name='d' filepath='Objects/dictobject.c' line='4374' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='4374' column='1'/>
-      <parameter type-id='type-id-4' name='default_value' filepath='Objects/dictobject.c' line='4374' column='1'/>
-      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='4375' column='1'/>
+    <function-decl name='PyDict_SetDefaultRef' mangled-name='PyDict_SetDefaultRef' filepath='Objects/dictobject.c' line='4371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_SetDefaultRef'>
+      <parameter type-id='type-id-4' name='d' filepath='Objects/dictobject.c' line='4371' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='4371' column='1'/>
+      <parameter type-id='type-id-4' name='default_value' filepath='Objects/dictobject.c' line='4371' column='1'/>
+      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='4372' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_SetDefault' mangled-name='PyDict_SetDefault' filepath='Objects/dictobject.c' line='4385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_SetDefault'>
-      <parameter type-id='type-id-4' name='d' filepath='Objects/dictobject.c' line='4385' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='4385' column='1'/>
-      <parameter type-id='type-id-4' name='defaultobj' filepath='Objects/dictobject.c' line='4385' column='1'/>
+    <function-decl name='PyDict_SetDefault' mangled-name='PyDict_SetDefault' filepath='Objects/dictobject.c' line='4382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_SetDefault'>
+      <parameter type-id='type-id-4' name='d' filepath='Objects/dictobject.c' line='4382' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/dictobject.c' line='4382' column='1'/>
+      <parameter type-id='type-id-4' name='defaultobj' filepath='Objects/dictobject.c' line='4382' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyDict_SizeOf' mangled-name='_PyDict_SizeOf' filepath='Objects/dictobject.c' line='4609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SizeOf'>
-      <parameter type-id='type-id-332' name='mp' filepath='Objects/dictobject.c' line='4609' column='1'/>
+    <function-decl name='_PyDict_SizeOf' mangled-name='_PyDict_SizeOf' filepath='Objects/dictobject.c' line='4608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_SizeOf'>
+      <parameter type-id='type-id-332' name='mp' filepath='Objects/dictobject.c' line='4608' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='PyDict_ContainsString' mangled-name='PyDict_ContainsString' filepath='Objects/dictobject.c' line='4716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_ContainsString'>
-      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='4716' column='1'/>
-      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4716' column='1'/>
+    <function-decl name='PyDict_ContainsString' mangled-name='PyDict_ContainsString' filepath='Objects/dictobject.c' line='4715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_ContainsString'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/dictobject.c' line='4715' column='1'/>
+      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4715' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_GetItemString' mangled-name='PyDict_GetItemString' filepath='Objects/dictobject.c' line='4918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_GetItemString'>
-      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='4918' column='1'/>
-      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4918' column='1'/>
+    <function-decl name='PyDict_GetItemString' mangled-name='PyDict_GetItemString' filepath='Objects/dictobject.c' line='4917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_GetItemString'>
+      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='4917' column='1'/>
+      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4917' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyDict_GetItemStringRef' mangled-name='PyDict_GetItemStringRef' filepath='Objects/dictobject.c' line='4936' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_GetItemStringRef'>
-      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='4936' column='1'/>
-      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4936' column='1'/>
-      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='4936' column='1'/>
+    <function-decl name='PyDict_GetItemStringRef' mangled-name='PyDict_GetItemStringRef' filepath='Objects/dictobject.c' line='4935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_GetItemStringRef'>
+      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='4935' column='1'/>
+      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4935' column='1'/>
+      <parameter type-id='type-id-235' name='result' filepath='Objects/dictobject.c' line='4935' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_DelItemString' mangled-name='PyDict_DelItemString' filepath='Objects/dictobject.c' line='4983' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_DelItemString'>
-      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='4983' column='1'/>
-      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4983' column='1'/>
+    <function-decl name='PyDict_DelItemString' mangled-name='PyDict_DelItemString' filepath='Objects/dictobject.c' line='4982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_DelItemString'>
+      <parameter type-id='type-id-4' name='v' filepath='Objects/dictobject.c' line='4982' column='1'/>
+      <parameter type-id='type-id-6' name='key' filepath='Objects/dictobject.c' line='4982' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyObject_VisitManagedDict' mangled-name='PyObject_VisitManagedDict' filepath='Objects/dictobject.c' line='7123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_VisitManagedDict'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/dictobject.c' line='7123' column='1'/>
-      <parameter type-id='type-id-334' name='visit' filepath='Objects/dictobject.c' line='7123' column='1'/>
-      <parameter type-id='type-id-30' name='arg' filepath='Objects/dictobject.c' line='7123' column='1'/>
+    <function-decl name='PyObject_VisitManagedDict' mangled-name='PyObject_VisitManagedDict' filepath='Objects/dictobject.c' line='7119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_VisitManagedDict'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/dictobject.c' line='7119' column='1'/>
+      <parameter type-id='type-id-334' name='visit' filepath='Objects/dictobject.c' line='7119' column='1'/>
+      <parameter type-id='type-id-30' name='arg' filepath='Objects/dictobject.c' line='7119' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyObject_SetManagedDict' mangled-name='_PyObject_SetManagedDict' filepath='Objects/dictobject.c' line='7166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_SetManagedDict'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/dictobject.c' line='7166' column='1'/>
-      <parameter type-id='type-id-4' name='new_dict' filepath='Objects/dictobject.c' line='7166' column='1'/>
+    <function-decl name='_PyObject_SetManagedDict' mangled-name='_PyObject_SetManagedDict' filepath='Objects/dictobject.c' line='7157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_SetManagedDict'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/dictobject.c' line='7157' column='1'/>
+      <parameter type-id='type-id-4' name='new_dict' filepath='Objects/dictobject.c' line='7157' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyObject_ClearManagedDict' mangled-name='PyObject_ClearManagedDict' filepath='Objects/dictobject.c' line='7229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_ClearManagedDict'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/dictobject.c' line='7229' column='1'/>
+    <function-decl name='PyObject_ClearManagedDict' mangled-name='PyObject_ClearManagedDict' filepath='Objects/dictobject.c' line='7220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_ClearManagedDict'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/dictobject.c' line='7220' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PyDict_Watch' mangled-name='PyDict_Watch' filepath='Objects/dictobject.c' line='7415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Watch'>
-      <parameter type-id='type-id-5' name='watcher_id' filepath='Objects/dictobject.c' line='7415' column='1'/>
-      <parameter type-id='type-id-4' name='dict' filepath='Objects/dictobject.c' line='7415' column='1'/>
+    <function-decl name='PyDict_Watch' mangled-name='PyDict_Watch' filepath='Objects/dictobject.c' line='7406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Watch'>
+      <parameter type-id='type-id-5' name='watcher_id' filepath='Objects/dictobject.c' line='7406' column='1'/>
+      <parameter type-id='type-id-4' name='dict' filepath='Objects/dictobject.c' line='7406' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_Unwatch' mangled-name='PyDict_Unwatch' filepath='Objects/dictobject.c' line='7430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Unwatch'>
-      <parameter type-id='type-id-5' name='watcher_id' filepath='Objects/dictobject.c' line='7430' column='1'/>
-      <parameter type-id='type-id-4' name='dict' filepath='Objects/dictobject.c' line='7430' column='1'/>
+    <function-decl name='PyDict_Unwatch' mangled-name='PyDict_Unwatch' filepath='Objects/dictobject.c' line='7421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Unwatch'>
+      <parameter type-id='type-id-5' name='watcher_id' filepath='Objects/dictobject.c' line='7421' column='1'/>
+      <parameter type-id='type-id-4' name='dict' filepath='Objects/dictobject.c' line='7421' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_AddWatcher' mangled-name='PyDict_AddWatcher' filepath='Objects/dictobject.c' line='7445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_AddWatcher'>
-      <parameter type-id='type-id-335' name='callback' filepath='Objects/dictobject.c' line='7445' column='1'/>
+    <function-decl name='PyDict_AddWatcher' mangled-name='PyDict_AddWatcher' filepath='Objects/dictobject.c' line='7436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_AddWatcher'>
+      <parameter type-id='type-id-335' name='callback' filepath='Objects/dictobject.c' line='7436' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyDict_ClearWatcher' mangled-name='PyDict_ClearWatcher' filepath='Objects/dictobject.c' line='7462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_ClearWatcher'>
-      <parameter type-id='type-id-5' name='watcher_id' filepath='Objects/dictobject.c' line='7462' column='1'/>
+    <function-decl name='PyDict_ClearWatcher' mangled-name='PyDict_ClearWatcher' filepath='Objects/dictobject.c' line='7453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_ClearWatcher'>
+      <parameter type-id='type-id-5' name='watcher_id' filepath='Objects/dictobject.c' line='7453' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
     <function-type size-in-bits='64' id='type-id-336'>
@@ -6503,14 +6502,14 @@
       <return type-id='type-id-5'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/enumobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/enumobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyEnum_Type' type-id='type-id-263' mangled-name='PyEnum_Type' visibility='default' filepath='./Include/enumobject.h' line='10' column='1' elf-symbol-id='PyEnum_Type'/>
     <var-decl name='PyReversed_Type' type-id='type-id-263' mangled-name='PyReversed_Type' visibility='default' filepath='./Include/enumobject.h' line='11' column='1' elf-symbol-id='PyReversed_Type'/>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/exceptions.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/exceptions.c' comp-dir-path='/src' language='LANG_C11'>
     <qualified-type-def type-id='type-id-17' const='yes' id='type-id-337'/>
     <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-125'/>
-    <var-decl name='PyExc_PythonFinalizationError' type-id='type-id-4' mangled-name='PyExc_PythonFinalizationError' visibility='default' filepath='./Include/cpython/pyerrors.h' line='130' column='1' elf-symbol-id='PyExc_PythonFinalizationError'/>
+    <var-decl name='PyExc_PythonFinalizationError' type-id='type-id-4' mangled-name='PyExc_PythonFinalizationError' visibility='default' filepath='./Include/cpython/pyerrors.h' line='129' column='1' elf-symbol-id='PyExc_PythonFinalizationError'/>
     <function-decl name='PyDict_New' mangled-name='PyDict_New' filepath='./Include/dictobject.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_New'>
       <return type-id='type-id-4'/>
     </function-decl>
@@ -6726,129 +6725,129 @@
       <parameter type-id='type-id-4' name='ob' filepath='Objects/exceptions.c' line='436' column='1'/>
       <return type-id='type-id-6'/>
     </function-decl>
-    <function-decl name='PyUnstable_Exc_PrepReraiseStar' mangled-name='PyUnstable_Exc_PrepReraiseStar' filepath='Objects/exceptions.c' line='1499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Exc_PrepReraiseStar'>
-      <parameter type-id='type-id-4' name='orig' filepath='Objects/exceptions.c' line='1499' column='1'/>
-      <parameter type-id='type-id-4' name='excs' filepath='Objects/exceptions.c' line='1499' column='1'/>
+    <function-decl name='PyUnstable_Exc_PrepReraiseStar' mangled-name='PyUnstable_Exc_PrepReraiseStar' filepath='Objects/exceptions.c' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Exc_PrepReraiseStar'>
+      <parameter type-id='type-id-4' name='orig' filepath='Objects/exceptions.c' line='1435' column='1'/>
+      <parameter type-id='type-id-4' name='excs' filepath='Objects/exceptions.c' line='1435' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_GetEncoding' mangled-name='PyUnicodeEncodeError_GetEncoding' filepath='Objects/exceptions.c' line='2741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetEncoding'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2741' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_GetEncoding' mangled-name='PyUnicodeEncodeError_GetEncoding' filepath='Objects/exceptions.c' line='2677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetEncoding'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2677' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_GetEncoding' mangled-name='PyUnicodeDecodeError_GetEncoding' filepath='Objects/exceptions.c' line='2747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetEncoding'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2747' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_GetEncoding' mangled-name='PyUnicodeDecodeError_GetEncoding' filepath='Objects/exceptions.c' line='2683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetEncoding'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2683' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_GetObject' mangled-name='PyUnicodeEncodeError_GetObject' filepath='Objects/exceptions.c' line='2753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetObject'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2753' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_GetObject' mangled-name='PyUnicodeEncodeError_GetObject' filepath='Objects/exceptions.c' line='2689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetObject'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2689' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_GetObject' mangled-name='PyUnicodeDecodeError_GetObject' filepath='Objects/exceptions.c' line='2759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetObject'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2759' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_GetObject' mangled-name='PyUnicodeDecodeError_GetObject' filepath='Objects/exceptions.c' line='2695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetObject'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2695' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeTranslateError_GetObject' mangled-name='PyUnicodeTranslateError_GetObject' filepath='Objects/exceptions.c' line='2765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetObject'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2765' column='1'/>
+    <function-decl name='PyUnicodeTranslateError_GetObject' mangled-name='PyUnicodeTranslateError_GetObject' filepath='Objects/exceptions.c' line='2701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetObject'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2701' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_GetStart' mangled-name='PyUnicodeEncodeError_GetStart' filepath='Objects/exceptions.c' line='2771' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetStart'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2771' column='1'/>
-      <parameter type-id='type-id-8' name='start' filepath='Objects/exceptions.c' line='2771' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_GetStart' mangled-name='PyUnicodeEncodeError_GetStart' filepath='Objects/exceptions.c' line='2707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetStart'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2707' column='1'/>
+      <parameter type-id='type-id-8' name='start' filepath='Objects/exceptions.c' line='2707' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_GetStart' mangled-name='PyUnicodeDecodeError_GetStart' filepath='Objects/exceptions.c' line='2790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetStart'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2790' column='1'/>
-      <parameter type-id='type-id-8' name='start' filepath='Objects/exceptions.c' line='2790' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_GetStart' mangled-name='PyUnicodeDecodeError_GetStart' filepath='Objects/exceptions.c' line='2726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetStart'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2726' column='1'/>
+      <parameter type-id='type-id-8' name='start' filepath='Objects/exceptions.c' line='2726' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeTranslateError_GetStart' mangled-name='PyUnicodeTranslateError_GetStart' filepath='Objects/exceptions.c' line='2808' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetStart'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2808' column='1'/>
-      <parameter type-id='type-id-8' name='start' filepath='Objects/exceptions.c' line='2808' column='1'/>
+    <function-decl name='PyUnicodeTranslateError_GetStart' mangled-name='PyUnicodeTranslateError_GetStart' filepath='Objects/exceptions.c' line='2744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetStart'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2744' column='1'/>
+      <parameter type-id='type-id-8' name='start' filepath='Objects/exceptions.c' line='2744' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_SetStart' mangled-name='PyUnicodeEncodeError_SetStart' filepath='Objects/exceptions.c' line='2815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_SetStart'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2815' column='1'/>
-      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='2815' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_SetStart' mangled-name='PyUnicodeEncodeError_SetStart' filepath='Objects/exceptions.c' line='2751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_SetStart'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2751' column='1'/>
+      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='2751' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_SetStart' mangled-name='PyUnicodeDecodeError_SetStart' filepath='Objects/exceptions.c' line='2823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_SetStart'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2823' column='1'/>
-      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='2823' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_SetStart' mangled-name='PyUnicodeDecodeError_SetStart' filepath='Objects/exceptions.c' line='2759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_SetStart'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2759' column='1'/>
+      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='2759' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeTranslateError_SetStart' mangled-name='PyUnicodeTranslateError_SetStart' filepath='Objects/exceptions.c' line='2831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_SetStart'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2831' column='1'/>
-      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='2831' column='1'/>
+    <function-decl name='PyUnicodeTranslateError_SetStart' mangled-name='PyUnicodeTranslateError_SetStart' filepath='Objects/exceptions.c' line='2767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_SetStart'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2767' column='1'/>
+      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='2767' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_GetEnd' mangled-name='PyUnicodeEncodeError_GetEnd' filepath='Objects/exceptions.c' line='2839' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetEnd'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2839' column='1'/>
-      <parameter type-id='type-id-8' name='end' filepath='Objects/exceptions.c' line='2839' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_GetEnd' mangled-name='PyUnicodeEncodeError_GetEnd' filepath='Objects/exceptions.c' line='2775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetEnd'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2775' column='1'/>
+      <parameter type-id='type-id-8' name='end' filepath='Objects/exceptions.c' line='2775' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_GetEnd' mangled-name='PyUnicodeDecodeError_GetEnd' filepath='Objects/exceptions.c' line='2858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetEnd'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2858' column='1'/>
-      <parameter type-id='type-id-8' name='end' filepath='Objects/exceptions.c' line='2858' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_GetEnd' mangled-name='PyUnicodeDecodeError_GetEnd' filepath='Objects/exceptions.c' line='2794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetEnd'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2794' column='1'/>
+      <parameter type-id='type-id-8' name='end' filepath='Objects/exceptions.c' line='2794' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeTranslateError_GetEnd' mangled-name='PyUnicodeTranslateError_GetEnd' filepath='Objects/exceptions.c' line='2876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetEnd'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2876' column='1'/>
-      <parameter type-id='type-id-8' name='end' filepath='Objects/exceptions.c' line='2876' column='1'/>
+    <function-decl name='PyUnicodeTranslateError_GetEnd' mangled-name='PyUnicodeTranslateError_GetEnd' filepath='Objects/exceptions.c' line='2812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetEnd'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2812' column='1'/>
+      <parameter type-id='type-id-8' name='end' filepath='Objects/exceptions.c' line='2812' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_SetEnd' mangled-name='PyUnicodeEncodeError_SetEnd' filepath='Objects/exceptions.c' line='2883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_SetEnd'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2883' column='1'/>
-      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='2883' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_SetEnd' mangled-name='PyUnicodeEncodeError_SetEnd' filepath='Objects/exceptions.c' line='2819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_SetEnd'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2819' column='1'/>
+      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='2819' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_SetEnd' mangled-name='PyUnicodeDecodeError_SetEnd' filepath='Objects/exceptions.c' line='2891' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_SetEnd'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2891' column='1'/>
-      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='2891' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_SetEnd' mangled-name='PyUnicodeDecodeError_SetEnd' filepath='Objects/exceptions.c' line='2827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_SetEnd'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2827' column='1'/>
+      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='2827' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeTranslateError_SetEnd' mangled-name='PyUnicodeTranslateError_SetEnd' filepath='Objects/exceptions.c' line='2899' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_SetEnd'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2899' column='1'/>
-      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='2899' column='1'/>
+    <function-decl name='PyUnicodeTranslateError_SetEnd' mangled-name='PyUnicodeTranslateError_SetEnd' filepath='Objects/exceptions.c' line='2835' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_SetEnd'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2835' column='1'/>
+      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='2835' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_GetReason' mangled-name='PyUnicodeEncodeError_GetReason' filepath='Objects/exceptions.c' line='2906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetReason'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2906' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_GetReason' mangled-name='PyUnicodeEncodeError_GetReason' filepath='Objects/exceptions.c' line='2842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_GetReason'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2842' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_GetReason' mangled-name='PyUnicodeDecodeError_GetReason' filepath='Objects/exceptions.c' line='2913' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetReason'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2913' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_GetReason' mangled-name='PyUnicodeDecodeError_GetReason' filepath='Objects/exceptions.c' line='2849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_GetReason'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2849' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeTranslateError_GetReason' mangled-name='PyUnicodeTranslateError_GetReason' filepath='Objects/exceptions.c' line='2920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetReason'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2920' column='1'/>
+    <function-decl name='PyUnicodeTranslateError_GetReason' mangled-name='PyUnicodeTranslateError_GetReason' filepath='Objects/exceptions.c' line='2856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_GetReason'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2856' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyUnicodeEncodeError_SetReason' mangled-name='PyUnicodeEncodeError_SetReason' filepath='Objects/exceptions.c' line='2927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_SetReason'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2927' column='1'/>
-      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='2927' column='1'/>
+    <function-decl name='PyUnicodeEncodeError_SetReason' mangled-name='PyUnicodeEncodeError_SetReason' filepath='Objects/exceptions.c' line='2863' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeEncodeError_SetReason'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2863' column='1'/>
+      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='2863' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_SetReason' mangled-name='PyUnicodeDecodeError_SetReason' filepath='Objects/exceptions.c' line='2935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_SetReason'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2935' column='1'/>
-      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='2935' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_SetReason' mangled-name='PyUnicodeDecodeError_SetReason' filepath='Objects/exceptions.c' line='2871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_SetReason'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2871' column='1'/>
+      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='2871' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeTranslateError_SetReason' mangled-name='PyUnicodeTranslateError_SetReason' filepath='Objects/exceptions.c' line='2943' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_SetReason'>
-      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2943' column='1'/>
-      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='2943' column='1'/>
+    <function-decl name='PyUnicodeTranslateError_SetReason' mangled-name='PyUnicodeTranslateError_SetReason' filepath='Objects/exceptions.c' line='2879' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeTranslateError_SetReason'>
+      <parameter type-id='type-id-4' name='exc' filepath='Objects/exceptions.c' line='2879' column='1'/>
+      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='2879' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyUnicodeDecodeError_Create' mangled-name='PyUnicodeDecodeError_Create' filepath='Objects/exceptions.c' line='3210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_Create'>
-      <parameter type-id='type-id-6' name='encoding' filepath='Objects/exceptions.c' line='3211' column='1'/>
-      <parameter type-id='type-id-6' name='object' filepath='Objects/exceptions.c' line='3211' column='1'/>
-      <parameter type-id='type-id-7' name='length' filepath='Objects/exceptions.c' line='3211' column='1'/>
-      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='3212' column='1'/>
-      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='3212' column='1'/>
-      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='3212' column='1'/>
+    <function-decl name='PyUnicodeDecodeError_Create' mangled-name='PyUnicodeDecodeError_Create' filepath='Objects/exceptions.c' line='3146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicodeDecodeError_Create'>
+      <parameter type-id='type-id-6' name='encoding' filepath='Objects/exceptions.c' line='3147' column='1'/>
+      <parameter type-id='type-id-6' name='object' filepath='Objects/exceptions.c' line='3147' column='1'/>
+      <parameter type-id='type-id-7' name='length' filepath='Objects/exceptions.c' line='3147' column='1'/>
+      <parameter type-id='type-id-7' name='start' filepath='Objects/exceptions.c' line='3148' column='1'/>
+      <parameter type-id='type-id-7' name='end' filepath='Objects/exceptions.c' line='3148' column='1'/>
+      <parameter type-id='type-id-6' name='reason' filepath='Objects/exceptions.c' line='3148' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/fileobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/fileobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyStdPrinter_Type' type-id='type-id-263' mangled-name='PyStdPrinter_Type' visibility='default' filepath='./Include/cpython/fileobject.h' line='10' column='1' elf-symbol-id='PyStdPrinter_Type'/>
     <function-decl name='_Py_write' mangled-name='_Py_write' filepath='./Include/internal/pycore_fileutils.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_write'>
       <parameter type-id='type-id-5'/>
@@ -6937,7 +6936,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/floatobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/floatobject.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='PyStructSequence_Field' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/structseq.h' line='10' column='1' id='type-id-339'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='name' type-id='type-id-6' visibility='default' filepath='./Include/structseq.h' line='11' column='1'/>
@@ -7006,6 +7005,11 @@
       <parameter type-id='type-id-245'/>
       <return type-id='type-id-170'/>
     </function-decl>
+    <function-decl name='_PyLong_Lshift' mangled-name='_PyLong_Lshift' filepath='./Include/internal/pycore_long.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_Lshift'>
+      <parameter type-id='type-id-4'/>
+      <parameter type-id='type-id-21'/>
+      <return type-id='type-id-4'/>
+    </function-decl>
     <function-decl name='_PyDebugAllocatorStats' filepath='./Include/internal/pycore_object.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-56'/>
       <parameter type-id='type-id-6'/>
@@ -7102,41 +7106,41 @@
       <parameter type-id='type-id-4' name='obj' filepath='Objects/floatobject.c' line='248' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PyFloat_Pack2' mangled-name='PyFloat_Pack2' filepath='Objects/floatobject.c' line='2034' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Pack2'>
-      <parameter type-id='type-id-170' name='x' filepath='Objects/floatobject.c' line='2034' column='1'/>
-      <parameter type-id='type-id-17' name='data' filepath='Objects/floatobject.c' line='2034' column='1'/>
-      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2034' column='1'/>
+    <function-decl name='PyFloat_Pack2' mangled-name='PyFloat_Pack2' filepath='Objects/floatobject.c' line='2049' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Pack2'>
+      <parameter type-id='type-id-170' name='x' filepath='Objects/floatobject.c' line='2049' column='1'/>
+      <parameter type-id='type-id-17' name='data' filepath='Objects/floatobject.c' line='2049' column='1'/>
+      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2049' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyFloat_Pack4' mangled-name='PyFloat_Pack4' filepath='Objects/floatobject.c' line='2139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Pack4'>
-      <parameter type-id='type-id-170' name='x' filepath='Objects/floatobject.c' line='2139' column='1'/>
-      <parameter type-id='type-id-17' name='data' filepath='Objects/floatobject.c' line='2139' column='1'/>
-      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2139' column='1'/>
+    <function-decl name='PyFloat_Pack4' mangled-name='PyFloat_Pack4' filepath='Objects/floatobject.c' line='2154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Pack4'>
+      <parameter type-id='type-id-170' name='x' filepath='Objects/floatobject.c' line='2154' column='1'/>
+      <parameter type-id='type-id-17' name='data' filepath='Objects/floatobject.c' line='2154' column='1'/>
+      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2154' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyFloat_Pack8' mangled-name='PyFloat_Pack8' filepath='Objects/floatobject.c' line='2247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Pack8'>
-      <parameter type-id='type-id-170' name='x' filepath='Objects/floatobject.c' line='2247' column='1'/>
-      <parameter type-id='type-id-17' name='data' filepath='Objects/floatobject.c' line='2247' column='1'/>
-      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2247' column='1'/>
+    <function-decl name='PyFloat_Pack8' mangled-name='PyFloat_Pack8' filepath='Objects/floatobject.c' line='2262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Pack8'>
+      <parameter type-id='type-id-170' name='x' filepath='Objects/floatobject.c' line='2262' column='1'/>
+      <parameter type-id='type-id-17' name='data' filepath='Objects/floatobject.c' line='2262' column='1'/>
+      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2262' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyFloat_Unpack2' mangled-name='PyFloat_Unpack2' filepath='Objects/floatobject.c' line='2377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Unpack2'>
-      <parameter type-id='type-id-6' name='data' filepath='Objects/floatobject.c' line='2377' column='1'/>
-      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2377' column='1'/>
+    <function-decl name='PyFloat_Unpack2' mangled-name='PyFloat_Unpack2' filepath='Objects/floatobject.c' line='2392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Unpack2'>
+      <parameter type-id='type-id-6' name='data' filepath='Objects/floatobject.c' line='2392' column='1'/>
+      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2392' column='1'/>
       <return type-id='type-id-170'/>
     </function-decl>
-    <function-decl name='PyFloat_Unpack4' mangled-name='PyFloat_Unpack4' filepath='Objects/floatobject.c' line='2429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Unpack4'>
-      <parameter type-id='type-id-6' name='data' filepath='Objects/floatobject.c' line='2429' column='1'/>
-      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2429' column='1'/>
+    <function-decl name='PyFloat_Unpack4' mangled-name='PyFloat_Unpack4' filepath='Objects/floatobject.c' line='2444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Unpack4'>
+      <parameter type-id='type-id-6' name='data' filepath='Objects/floatobject.c' line='2444' column='1'/>
+      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2444' column='1'/>
       <return type-id='type-id-170'/>
     </function-decl>
-    <function-decl name='PyFloat_Unpack8' mangled-name='PyFloat_Unpack8' filepath='Objects/floatobject.c' line='2508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Unpack8'>
-      <parameter type-id='type-id-6' name='data' filepath='Objects/floatobject.c' line='2508' column='1'/>
-      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2508' column='1'/>
+    <function-decl name='PyFloat_Unpack8' mangled-name='PyFloat_Unpack8' filepath='Objects/floatobject.c' line='2523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_Unpack8'>
+      <parameter type-id='type-id-6' name='data' filepath='Objects/floatobject.c' line='2523' column='1'/>
+      <parameter type-id='type-id-5' name='le' filepath='Objects/floatobject.c' line='2523' column='1'/>
       <return type-id='type-id-170'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/frameobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/frameobject.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='PyFrameConstructor' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-345' visibility='default' filepath='./Include/cpython/funcobject.h' line='21' column='1' id='type-id-346'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='fc_globals' type-id='type-id-4' visibility='default' filepath='./Include/cpython/funcobject.h' line='22' column='1'/>
@@ -7312,7 +7316,7 @@
     </function-decl>
     <type-decl name='bool' size-in-bits='8' id='type-id-349'/>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/funcobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/funcobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyFunction_Type' type-id='type-id-263' mangled-name='PyFunction_Type' visibility='default' filepath='./Include/cpython/funcobject.h' line='65' column='1' elf-symbol-id='PyFunction_Type'/>
     <var-decl name='PyClassMethod_Type' type-id='type-id-263' mangled-name='PyClassMethod_Type' visibility='default' filepath='./Include/cpython/funcobject.h' line='125' column='1' elf-symbol-id='PyClassMethod_Type'/>
     <var-decl name='PyStaticMethod_Type' type-id='type-id-263' mangled-name='PyStaticMethod_Type' visibility='default' filepath='./Include/cpython/funcobject.h' line='126' column='1' elf-symbol-id='PyStaticMethod_Type'/>
@@ -7405,16 +7409,16 @@
       <parameter type-id='type-id-4' name='annotations' filepath='Objects/funcobject.c' line='555' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyClassMethod_New' mangled-name='PyClassMethod_New' filepath='Objects/funcobject.c' line='1357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyClassMethod_New'>
-      <parameter type-id='type-id-4' name='callable' filepath='Objects/funcobject.c' line='1357' column='1'/>
+    <function-decl name='PyClassMethod_New' mangled-name='PyClassMethod_New' filepath='Objects/funcobject.c' line='1345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyClassMethod_New'>
+      <parameter type-id='type-id-4' name='callable' filepath='Objects/funcobject.c' line='1345' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyStaticMethod_New' mangled-name='PyStaticMethod_New' filepath='Objects/funcobject.c' line='1563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStaticMethod_New'>
-      <parameter type-id='type-id-4' name='callable' filepath='Objects/funcobject.c' line='1563' column='1'/>
+    <function-decl name='PyStaticMethod_New' mangled-name='PyStaticMethod_New' filepath='Objects/funcobject.c' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStaticMethod_New'>
+      <parameter type-id='type-id-4' name='callable' filepath='Objects/funcobject.c' line='1539' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/genericaliasobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/genericaliasobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyUnicodeWriter_WriteASCIIString' mangled-name='_PyUnicodeWriter_WriteASCIIString' filepath='./Include/cpython/unicodeobject.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyUnicodeWriter_WriteASCIIString'>
       <parameter type-id='type-id-327'/>
       <parameter type-id='type-id-6'/>
@@ -7427,11 +7431,6 @@
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyList_GetItemRef' mangled-name='PyList_GetItemRef' filepath='./Include/listobject.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_GetItemRef'>
-      <parameter type-id='type-id-4'/>
-      <parameter type-id='type-id-7'/>
-      <return type-id='type-id-4'/>
-    </function-decl>
     <function-decl name='PyList_SetSlice' mangled-name='PyList_SetSlice' filepath='./Include/listobject.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_SetSlice'>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-7'/>
@@ -7453,7 +7452,7 @@
       <return type-id='type-id-3'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/genobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/genobject.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='PyGenObject' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-351' visibility='default' filepath='./Include/cpython/genobject.h' line='31' column='1' id='type-id-352'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='ob_base' type-id='type-id-353' visibility='default' filepath='./Include/cpython/genobject.h' line='33' column='1'/>
@@ -7526,7 +7525,7 @@
       </data-member>
     </class-decl>
     <typedef-decl name='PyAsyncGenObject' type-id='type-id-358' filepath='./Include/cpython/genobject.h' line='64' column='1' id='type-id-357'/>
-    <typedef-decl name='_PyInterpreterFrame' type-id='type-id-359' filepath='./Include/internal/pycore_frame.h' line='76' column='1' id='type-id-360'/>
+    <typedef-decl name='_PyInterpreterFrame' type-id='type-id-359' filepath='./Include/internal/pycore_frame.h' line='75' column='1' id='type-id-360'/>
     <typedef-decl name='int8_t' type-id='type-id-361' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='24' column='1' id='type-id-355'/>
     <typedef-decl name='__int8_t' type-id='type-id-362' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-361'/>
     <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-363'/>
@@ -7542,7 +7541,7 @@
     <var-decl name='PyCoro_Type' type-id='type-id-263' mangled-name='PyCoro_Type' visibility='default' filepath='./Include/cpython/genobject.h' line='53' column='1' elf-symbol-id='PyCoro_Type'/>
     <var-decl name='PyAsyncGen_Type' type-id='type-id-263' mangled-name='PyAsyncGen_Type' visibility='default' filepath='./Include/cpython/genobject.h' line='66' column='1' elf-symbol-id='PyAsyncGen_Type'/>
     <var-decl name='_PyAsyncGenASend_Type' type-id='type-id-263' mangled-name='_PyAsyncGenASend_Type' visibility='default' filepath='./Include/cpython/genobject.h' line='67' column='1' elf-symbol-id='_PyAsyncGenASend_Type'/>
-    <function-decl name='PyObject_CallFinalizerFromDealloc' mangled-name='PyObject_CallFinalizerFromDealloc' filepath='./Include/cpython/object.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFinalizerFromDealloc'>
+    <function-decl name='PyObject_CallFinalizerFromDealloc' mangled-name='PyObject_CallFinalizerFromDealloc' filepath='./Include/cpython/object.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFinalizerFromDealloc'>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-5'/>
     </function-decl>
@@ -7550,22 +7549,18 @@
       <parameter type-id='type-id-366'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyEval_GetFrame' filepath='./Include/internal/pycore_ceval.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyEval_GetFrame' filepath='./Include/internal/pycore_ceval.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-366'/>
     </function-decl>
-    <function-decl name='_PyEval_NoToolsForUnwind' mangled-name='_PyEval_NoToolsForUnwind' filepath='./Include/internal/pycore_ceval.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyEval_NoToolsForUnwind'>
-      <parameter type-id='type-id-27'/>
-      <return type-id='type-id-349'/>
-    </function-decl>
-    <function-decl name='_PyFrame_MakeAndSetFrameObject' filepath='./Include/internal/pycore_frame.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyFrame_MakeAndSetFrameObject' filepath='./Include/internal/pycore_frame.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-365'/>
       <return type-id='type-id-348'/>
     </function-decl>
-    <function-decl name='_PyFrame_ClearExceptCode' filepath='./Include/internal/pycore_frame.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyFrame_ClearExceptCode' filepath='./Include/internal/pycore_frame.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-365'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_PyFrame_Traverse' filepath='./Include/internal/pycore_frame.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyFrame_Traverse' filepath='./Include/internal/pycore_frame.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-365'/>
       <parameter type-id='type-id-334'/>
       <parameter type-id='type-id-30'/>
@@ -7613,42 +7608,42 @@
       <parameter type-id='type-id-364' name='gen' filepath='Objects/genobject.c' line='349' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyGen_SetStopIterationValue' mangled-name='_PyGen_SetStopIterationValue' filepath='Objects/genobject.c' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGen_SetStopIterationValue'>
-      <parameter type-id='type-id-4' name='value' filepath='Objects/genobject.c' line='614' column='1'/>
+    <function-decl name='_PyGen_SetStopIterationValue' mangled-name='_PyGen_SetStopIterationValue' filepath='Objects/genobject.c' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGen_SetStopIterationValue'>
+      <parameter type-id='type-id-4' name='value' filepath='Objects/genobject.c' line='612' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_Py_MakeCoro' mangled-name='_Py_MakeCoro' filepath='Objects/genobject.c' line='891' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_MakeCoro'>
-      <parameter type-id='type-id-305' name='func' filepath='Objects/genobject.c' line='891' column='1'/>
+    <function-decl name='_Py_MakeCoro' mangled-name='_Py_MakeCoro' filepath='Objects/genobject.c' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_MakeCoro'>
+      <parameter type-id='type-id-305' name='func' filepath='Objects/genobject.c' line='889' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyGen_NewWithQualName' mangled-name='PyGen_NewWithQualName' filepath='Objects/genobject.c' line='974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGen_NewWithQualName'>
-      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='974' column='1'/>
-      <parameter type-id='type-id-4' name='name' filepath='Objects/genobject.c' line='974' column='1'/>
-      <parameter type-id='type-id-4' name='qualname' filepath='Objects/genobject.c' line='974' column='1'/>
+    <function-decl name='PyGen_NewWithQualName' mangled-name='PyGen_NewWithQualName' filepath='Objects/genobject.c' line='972' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGen_NewWithQualName'>
+      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='972' column='1'/>
+      <parameter type-id='type-id-4' name='name' filepath='Objects/genobject.c' line='972' column='1'/>
+      <parameter type-id='type-id-4' name='qualname' filepath='Objects/genobject.c' line='972' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyGen_New' mangled-name='PyGen_New' filepath='Objects/genobject.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGen_New'>
-      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='980' column='1'/>
+    <function-decl name='PyGen_New' mangled-name='PyGen_New' filepath='Objects/genobject.c' line='978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGen_New'>
+      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='978' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyCoro_GetAwaitableIter' mangled-name='_PyCoro_GetAwaitableIter' filepath='Objects/genobject.c' line='1013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCoro_GetAwaitableIter'>
-      <parameter type-id='type-id-4' name='o' filepath='Objects/genobject.c' line='1013' column='1'/>
+    <function-decl name='_PyCoro_GetAwaitableIter' mangled-name='_PyCoro_GetAwaitableIter' filepath='Objects/genobject.c' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCoro_GetAwaitableIter'>
+      <parameter type-id='type-id-4' name='o' filepath='Objects/genobject.c' line='1011' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyCoro_New' mangled-name='PyCoro_New' filepath='Objects/genobject.c' line='1339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCoro_New'>
-      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='1339' column='1'/>
-      <parameter type-id='type-id-4' name='name' filepath='Objects/genobject.c' line='1339' column='1'/>
-      <parameter type-id='type-id-4' name='qualname' filepath='Objects/genobject.c' line='1339' column='1'/>
+    <function-decl name='PyCoro_New' mangled-name='PyCoro_New' filepath='Objects/genobject.c' line='1337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCoro_New'>
+      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='1337' column='1'/>
+      <parameter type-id='type-id-4' name='name' filepath='Objects/genobject.c' line='1337' column='1'/>
+      <parameter type-id='type-id-4' name='qualname' filepath='Objects/genobject.c' line='1337' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyAsyncGen_New' mangled-name='PyAsyncGen_New' filepath='Objects/genobject.c' line='1652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyAsyncGen_New'>
-      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='1652' column='1'/>
-      <parameter type-id='type-id-4' name='name' filepath='Objects/genobject.c' line='1652' column='1'/>
-      <parameter type-id='type-id-4' name='qualname' filepath='Objects/genobject.c' line='1652' column='1'/>
+    <function-decl name='PyAsyncGen_New' mangled-name='PyAsyncGen_New' filepath='Objects/genobject.c' line='1650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyAsyncGen_New'>
+      <parameter type-id='type-id-348' name='f' filepath='Objects/genobject.c' line='1650' column='1'/>
+      <parameter type-id='type-id-4' name='name' filepath='Objects/genobject.c' line='1650' column='1'/>
+      <parameter type-id='type-id-4' name='qualname' filepath='Objects/genobject.c' line='1650' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/iterobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/iterobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyObject_HasLen' filepath='./Include/internal/pycore_abstract.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-5'/>
@@ -7661,7 +7656,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/listobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/listobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyEval_SliceIndexNotNone' mangled-name='_PyEval_SliceIndexNotNone' filepath='./Include/cpython/ceval.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyEval_SliceIndexNotNone'>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-8'/>
@@ -7698,6 +7693,11 @@
       <parameter type-id='type-id-4' name='op' filepath='Objects/listobject.c' line='339' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
+    <function-decl name='PyList_GetItemRef' mangled-name='PyList_GetItemRef' filepath='Objects/listobject.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_GetItemRef'>
+      <parameter type-id='type-id-4' name='op' filepath='Objects/listobject.c' line='436' column='1'/>
+      <parameter type-id='type-id-7' name='i' filepath='Objects/listobject.c' line='436' column='1'/>
+      <return type-id='type-id-4'/>
+    </function-decl>
     <function-decl name='PyList_SetItem' mangled-name='PyList_SetItem' filepath='Objects/listobject.c' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_SetItem'>
       <parameter type-id='type-id-4' name='op' filepath='Objects/listobject.c' line='452' column='1'/>
       <parameter type-id='type-id-7' name='i' filepath='Objects/listobject.c' line='452' column='1'/>
@@ -7740,7 +7740,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/longobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/longobject.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='2048' id='type-id-367'>
       <subrange length='256' type-id='type-id-2' id='type-id-69'/>
     </array-type-def>
@@ -7914,11 +7914,6 @@
       <parameter type-id='type-id-21' name='shiftby' filepath='Objects/longobject.c' line='5350' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyLong_Lshift' mangled-name='_PyLong_Lshift' filepath='Objects/longobject.c' line='5427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_Lshift'>
-      <parameter type-id='type-id-4' name='a' filepath='Objects/longobject.c' line='5427' column='1'/>
-      <parameter type-id='type-id-21' name='shiftby' filepath='Objects/longobject.c' line='5427' column='1'/>
-      <return type-id='type-id-4'/>
-    </function-decl>
     <function-decl name='_PyLong_GCD' mangled-name='_PyLong_GCD' filepath='Objects/longobject.c' line='5629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_GCD'>
       <parameter type-id='type-id-4' name='aarg' filepath='Objects/longobject.c' line='5629' column='1'/>
       <parameter type-id='type-id-4' name='barg' filepath='Objects/longobject.c' line='5629' column='1'/>
@@ -7941,7 +7936,7 @@
       <return type-id='type-id-7'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/memoryobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/memoryobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='_PyManagedBuffer_Type' type-id='type-id-263' visibility='default' filepath='./Include/internal/pycore_memoryobject.h' line='11' column='1'/>
     <var-decl name='PyMemoryView_Type' type-id='type-id-263' mangled-name='PyMemoryView_Type' visibility='default' filepath='./Include/memoryobject.h' line='9' column='1' elf-symbol-id='PyMemoryView_Type'/>
     <function-decl name='PyUnicode_AsASCIIString' mangled-name='PyUnicode_AsASCIIString' filepath='./Include/unicodeobject.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicode_AsASCIIString'>
@@ -7969,7 +7964,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/methodobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/methodobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyCMethod_Type' type-id='type-id-263' mangled-name='PyCMethod_Type' visibility='default' filepath='./Include/cpython/methodobject.h' line='32' column='1' elf-symbol-id='PyCMethod_Type'/>
     <var-decl name='PyCFunction_Type' type-id='type-id-263' mangled-name='PyCFunction_Type' visibility='default' filepath='./Include/methodobject.h' line='14' column='1' elf-symbol-id='PyCFunction_Type'/>
     <function-decl name='PyCFunction_New' mangled-name='PyCFunction_New' filepath='Objects/methodobject.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCFunction_New'>
@@ -7996,7 +7991,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/moduleobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/moduleobject.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='PyModuleDef_Base' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/moduleobject.h' line='39' column='1' id='type-id-378'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='ob_base' type-id='type-id-353' visibility='default' filepath='./Include/moduleobject.h' line='40' column='1'/>
@@ -8055,7 +8050,7 @@
     <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-383'/>
     <qualified-type-def type-id='type-id-387' const='yes' id='type-id-388'/>
     <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-18'/>
-    <function-decl name='_PyObject_GenericGetAttrWithDict' mangled-name='_PyObject_GenericGetAttrWithDict' filepath='./Include/cpython/object.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GenericGetAttrWithDict'>
+    <function-decl name='_PyObject_GenericGetAttrWithDict' mangled-name='_PyObject_GenericGetAttrWithDict' filepath='./Include/cpython/object.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GenericGetAttrWithDict'>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-4'/>
@@ -8189,7 +8184,7 @@
       <return type-id='type-id-4'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/namespaceobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/namespaceobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyArg_NoPositional' mangled-name='_PyArg_NoPositional' filepath='./Include/internal/pycore_modsupport.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_NoPositional'>
       <parameter type-id='type-id-6'/>
       <parameter type-id='type-id-4'/>
@@ -8201,12 +8196,12 @@
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyNamespace_New' mangled-name='_PyNamespace_New' filepath='Objects/namespaceobject.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNamespace_New'>
-      <parameter type-id='type-id-4' name='kwds' filepath='Objects/namespaceobject.c' line='313' column='1'/>
+    <function-decl name='_PyNamespace_New' mangled-name='_PyNamespace_New' filepath='Objects/namespaceobject.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNamespace_New'>
+      <parameter type-id='type-id-4' name='kwds' filepath='Objects/namespaceobject.c' line='302' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/object.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/object.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='192' id='type-id-95'>
       <subrange length='6' type-id='type-id-2' id='type-id-390'/>
     </array-type-def>
@@ -8244,7 +8239,7 @@
     <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
     <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-400'/>
     <qualified-type-def type-id='type-id-30' restrict='yes' id='type-id-229'/>
-    <function-decl name='_PyEval_GetFrameLocals' filepath='./Include/internal/pycore_ceval.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyEval_GetFrameLocals' filepath='./Include/internal/pycore_ceval.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-4'/>
     </function-decl>
     <function-decl name='_PyDict_DebugMallocStats' filepath='./Include/internal/pycore_dict.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -8619,7 +8614,7 @@
       <subrange length='80' type-id='type-id-2' id='type-id-415'/>
     </array-type-def>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/obmalloc.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/obmalloc.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-416' size-in-bits='14400' id='type-id-417'>
       <subrange length='75' type-id='type-id-2' id='type-id-418'/>
     </array-type-def>
@@ -9207,13 +9202,13 @@
       <parameter type-id='type-id-6'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='PyGILState_Check' mangled-name='PyGILState_Check' filepath='./Include/cpython/pystate.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGILState_Check'>
+    <function-decl name='PyGILState_Check' mangled-name='PyGILState_Check' filepath='./Include/cpython/pystate.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGILState_Check'>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyInterpreterState_Head' mangled-name='PyInterpreterState_Head' filepath='./Include/cpython/pystate.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInterpreterState_Head'>
+    <function-decl name='PyInterpreterState_Head' mangled-name='PyInterpreterState_Head' filepath='./Include/cpython/pystate.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInterpreterState_Head'>
       <return type-id='type-id-28'/>
     </function-decl>
-    <function-decl name='PyInterpreterState_Next' mangled-name='PyInterpreterState_Next' filepath='./Include/cpython/pystate.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInterpreterState_Next'>
+    <function-decl name='PyInterpreterState_Next' mangled-name='PyInterpreterState_Next' filepath='./Include/cpython/pystate.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInterpreterState_Next'>
       <parameter type-id='type-id-28'/>
       <return type-id='type-id-28'/>
     </function-decl>
@@ -9407,13 +9402,13 @@
       <return type-id='type-id-3'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/odictobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/odictobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyODict_Type' type-id='type-id-263' mangled-name='PyODict_Type' visibility='default' filepath='./Include/cpython/odictobject.h' line='15' column='1' elf-symbol-id='PyODict_Type'/>
     <var-decl name='PyODictIter_Type' type-id='type-id-263' mangled-name='PyODictIter_Type' visibility='default' filepath='./Include/cpython/odictobject.h' line='16' column='1' elf-symbol-id='PyODictIter_Type'/>
     <var-decl name='PyODictKeys_Type' type-id='type-id-263' mangled-name='PyODictKeys_Type' visibility='default' filepath='./Include/cpython/odictobject.h' line='17' column='1' elf-symbol-id='PyODictKeys_Type'/>
     <var-decl name='PyODictItems_Type' type-id='type-id-263' mangled-name='PyODictItems_Type' visibility='default' filepath='./Include/cpython/odictobject.h' line='18' column='1' elf-symbol-id='PyODictItems_Type'/>
     <var-decl name='PyODictValues_Type' type-id='type-id-263' mangled-name='PyODictValues_Type' visibility='default' filepath='./Include/cpython/odictobject.h' line='19' column='1' elf-symbol-id='PyODictValues_Type'/>
-    <function-decl name='_PyErr_ChainExceptions1' mangled-name='_PyErr_ChainExceptions1' filepath='./Include/cpython/pyerrors.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_ChainExceptions1'>
+    <function-decl name='_PyErr_ChainExceptions1' mangled-name='_PyErr_ChainExceptions1' filepath='./Include/cpython/pyerrors.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_ChainExceptions1'>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-3'/>
     </function-decl>
@@ -9485,7 +9480,7 @@
       </data-member>
     </class-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/picklebufobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/picklebufobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='PyPickleBuffer_Type' type-id='type-id-263' mangled-name='PyPickleBuffer_Type' visibility='default' filepath='./Include/cpython/picklebufobject.h' line='13' column='1' elf-symbol-id='PyPickleBuffer_Type'/>
     <function-decl name='PyPickleBuffer_FromObject' mangled-name='PyPickleBuffer_FromObject' filepath='Objects/picklebufobject.c' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyPickleBuffer_FromObject'>
       <parameter type-id='type-id-4' name='base' filepath='Objects/picklebufobject.c' line='17' column='1'/>
@@ -9500,7 +9495,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/rangeobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/rangeobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PySequence_IterSearch' filepath='./Include/internal/pycore_abstract.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
       <parameter type-id='type-id-4'/>
@@ -9519,7 +9514,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/setobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/setobject.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-513' size-in-bits='1024' id='type-id-514'>
       <subrange length='8' type-id='type-id-2' id='type-id-515'/>
     </array-type-def>
@@ -9579,30 +9574,30 @@
     <var-decl name='PySet_Type' type-id='type-id-263' mangled-name='PySet_Type' visibility='default' filepath='./Include/setobject.h' line='9' column='1' elf-symbol-id='PySet_Type'/>
     <var-decl name='PyFrozenSet_Type' type-id='type-id-263' mangled-name='PyFrozenSet_Type' visibility='default' filepath='./Include/setobject.h' line='10' column='1' elf-symbol-id='PyFrozenSet_Type'/>
     <var-decl name='PySetIter_Type' type-id='type-id-263' mangled-name='PySetIter_Type' visibility='default' filepath='./Include/setobject.h' line='11' column='1' elf-symbol-id='PySetIter_Type'/>
-    <function-decl name='_PySet_Contains' mangled-name='_PySet_Contains' filepath='Objects/setobject.c' line='2177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySet_Contains'>
-      <parameter type-id='type-id-520' name='so' filepath='Objects/setobject.c' line='2177' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/setobject.c' line='2177' column='1'/>
+    <function-decl name='_PySet_Contains' mangled-name='_PySet_Contains' filepath='Objects/setobject.c' line='2174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySet_Contains'>
+      <parameter type-id='type-id-520' name='so' filepath='Objects/setobject.c' line='2174' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/setobject.c' line='2174' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PySet_Size' mangled-name='PySet_Size' filepath='Objects/setobject.c' line='2613' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Size'>
-      <parameter type-id='type-id-4' name='anyset' filepath='Objects/setobject.c' line='2613' column='1'/>
+    <function-decl name='PySet_Size' mangled-name='PySet_Size' filepath='Objects/setobject.c' line='2610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Size'>
+      <parameter type-id='type-id-4' name='anyset' filepath='Objects/setobject.c' line='2610' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='PySet_Clear' mangled-name='PySet_Clear' filepath='Objects/setobject.c' line='2623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Clear'>
-      <parameter type-id='type-id-4' name='set' filepath='Objects/setobject.c' line='2623' column='1'/>
+    <function-decl name='PySet_Clear' mangled-name='PySet_Clear' filepath='Objects/setobject.c' line='2620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Clear'>
+      <parameter type-id='type-id-4' name='set' filepath='Objects/setobject.c' line='2620' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PySet_Discard' mangled-name='PySet_Discard' filepath='Objects/setobject.c' line='2655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Discard'>
-      <parameter type-id='type-id-4' name='set' filepath='Objects/setobject.c' line='2655' column='1'/>
-      <parameter type-id='type-id-4' name='key' filepath='Objects/setobject.c' line='2655' column='1'/>
+    <function-decl name='PySet_Discard' mangled-name='PySet_Discard' filepath='Objects/setobject.c' line='2652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Discard'>
+      <parameter type-id='type-id-4' name='set' filepath='Objects/setobject.c' line='2652' column='1'/>
+      <parameter type-id='type-id-4' name='key' filepath='Objects/setobject.c' line='2652' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PySet_Pop' mangled-name='PySet_Pop' filepath='Objects/setobject.c' line='2719' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Pop'>
-      <parameter type-id='type-id-4' name='set' filepath='Objects/setobject.c' line='2719' column='1'/>
+    <function-decl name='PySet_Pop' mangled-name='PySet_Pop' filepath='Objects/setobject.c' line='2716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySet_Pop'>
+      <parameter type-id='type-id-4' name='set' filepath='Objects/setobject.c' line='2716' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/sliceobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/sliceobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='_Py_EllipsisObject' type-id='type-id-353' mangled-name='_Py_EllipsisObject' visibility='default' filepath='./Include/sliceobject.h' line='9' column='1' elf-symbol-id='_Py_EllipsisObject'/>
     <var-decl name='PySlice_Type' type-id='type-id-263' mangled-name='PySlice_Type' visibility='default' filepath='./Include/sliceobject.h' line='32' column='1' elf-symbol-id='PySlice_Type'/>
     <var-decl name='PyEllipsis_Type' type-id='type-id-263' mangled-name='PyEllipsis_Type' visibility='default' filepath='./Include/sliceobject.h' line='33' column='1' elf-symbol-id='PyEllipsis_Type'/>
@@ -9630,7 +9625,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/structseq.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/structseq.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='PyType_Slot' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-521' visibility='default' filepath='./Include/object.h' line='499' column='1' id='type-id-522'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='slot' type-id='type-id-5' visibility='default' filepath='./Include/object.h' line='500' column='1'/>
@@ -9675,27 +9670,27 @@
       <parameter type-id='type-id-7' name='index' filepath='Objects/structseq.c' line='98' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyStructSequence_InitType2' mangled-name='PyStructSequence_InitType2' filepath='Objects/structseq.c' line='678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStructSequence_InitType2'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/structseq.c' line='678' column='1'/>
-      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='678' column='1'/>
+    <function-decl name='PyStructSequence_InitType2' mangled-name='PyStructSequence_InitType2' filepath='Objects/structseq.c' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStructSequence_InitType2'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/structseq.c' line='677' column='1'/>
+      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='677' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyStructSequence_InitType' mangled-name='PyStructSequence_InitType' filepath='Objects/structseq.c' line='712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStructSequence_InitType'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/structseq.c' line='712' column='1'/>
-      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='712' column='1'/>
+    <function-decl name='PyStructSequence_InitType' mangled-name='PyStructSequence_InitType' filepath='Objects/structseq.c' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStructSequence_InitType'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/structseq.c' line='711' column='1'/>
+      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='711' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='_PyStructSequence_NewType' mangled-name='_PyStructSequence_NewType' filepath='Objects/structseq.c' line='750' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStructSequence_NewType'>
-      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='750' column='1'/>
-      <parameter type-id='type-id-2' name='tp_flags' filepath='Objects/structseq.c' line='750' column='1'/>
+    <function-decl name='_PyStructSequence_NewType' mangled-name='_PyStructSequence_NewType' filepath='Objects/structseq.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStructSequence_NewType'>
+      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='749' column='1'/>
+      <parameter type-id='type-id-2' name='tp_flags' filepath='Objects/structseq.c' line='749' column='1'/>
       <return type-id='type-id-1'/>
     </function-decl>
-    <function-decl name='PyStructSequence_NewType' mangled-name='PyStructSequence_NewType' filepath='Objects/structseq.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStructSequence_NewType'>
-      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='802' column='1'/>
+    <function-decl name='PyStructSequence_NewType' mangled-name='PyStructSequence_NewType' filepath='Objects/structseq.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStructSequence_NewType'>
+      <parameter type-id='type-id-344' name='desc' filepath='Objects/structseq.c' line='801' column='1'/>
       <return type-id='type-id-1'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/tupleobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/tupleobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='./Include/objimpl.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize'>
       <parameter type-id='type-id-318'/>
       <parameter type-id='type-id-7'/>
@@ -9715,7 +9710,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/typeobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/typeobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='PyEval_GetGlobals' mangled-name='PyEval_GetGlobals' filepath='./Include/ceval.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_GetGlobals'>
       <return type-id='type-id-4'/>
     </function-decl>
@@ -9880,114 +9875,114 @@
       <parameter type-id='type-id-4' name='obj' filepath='Objects/typeobject.c' line='951' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyType_Modified' mangled-name='PyType_Modified' filepath='Objects/typeobject.c' line='1054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_Modified'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='1054' column='1'/>
+    <function-decl name='PyType_Modified' mangled-name='PyType_Modified' filepath='Objects/typeobject.c' line='1053' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_Modified'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='1053' column='1'/>
       <return type-id='type-id-3'/>
     </function-decl>
-    <function-decl name='PyUnstable_Type_AssignVersionTag' mangled-name='PyUnstable_Type_AssignVersionTag' filepath='Objects/typeobject.c' line='1189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Type_AssignVersionTag'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='1189' column='1'/>
+    <function-decl name='PyUnstable_Type_AssignVersionTag' mangled-name='PyUnstable_Type_AssignVersionTag' filepath='Objects/typeobject.c' line='1179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Type_AssignVersionTag'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='1179' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyType_GetFullyQualifiedName' mangled-name='PyType_GetFullyQualifiedName' filepath='Objects/typeobject.c' line='1409' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetFullyQualifiedName'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='1409' column='1'/>
+    <function-decl name='PyType_GetFullyQualifiedName' mangled-name='PyType_GetFullyQualifiedName' filepath='Objects/typeobject.c' line='1399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetFullyQualifiedName'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='1399' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyType_GetFlags' mangled-name='PyType_GetFlags' filepath='Objects/typeobject.c' line='3425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetFlags'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='3425' column='1'/>
+    <function-decl name='PyType_GetFlags' mangled-name='PyType_GetFlags' filepath='Objects/typeobject.c' line='3410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetFlags'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='3410' column='1'/>
       <return type-id='type-id-2'/>
     </function-decl>
-    <function-decl name='PyType_SUPPORTS_WEAKREFS' mangled-name='PyType_SUPPORTS_WEAKREFS' filepath='Objects/typeobject.c' line='3432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_SUPPORTS_WEAKREFS'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='3432' column='1'/>
+    <function-decl name='PyType_SUPPORTS_WEAKREFS' mangled-name='PyType_SUPPORTS_WEAKREFS' filepath='Objects/typeobject.c' line='3417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_SUPPORTS_WEAKREFS'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='3417' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='PyType_FromMetaclass' mangled-name='PyType_FromMetaclass' filepath='Objects/typeobject.c' line='4877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_FromMetaclass'>
-      <parameter type-id='type-id-1' name='metaclass' filepath='Objects/typeobject.c' line='4877' column='1'/>
-      <parameter type-id='type-id-4' name='module' filepath='Objects/typeobject.c' line='4877' column='1'/>
-      <parameter type-id='type-id-525' name='spec' filepath='Objects/typeobject.c' line='4878' column='1'/>
-      <parameter type-id='type-id-4' name='bases_in' filepath='Objects/typeobject.c' line='4878' column='1'/>
+    <function-decl name='PyType_FromMetaclass' mangled-name='PyType_FromMetaclass' filepath='Objects/typeobject.c' line='4862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_FromMetaclass'>
+      <parameter type-id='type-id-1' name='metaclass' filepath='Objects/typeobject.c' line='4862' column='1'/>
+      <parameter type-id='type-id-4' name='module' filepath='Objects/typeobject.c' line='4862' column='1'/>
+      <parameter type-id='type-id-525' name='spec' filepath='Objects/typeobject.c' line='4863' column='1'/>
+      <parameter type-id='type-id-4' name='bases_in' filepath='Objects/typeobject.c' line='4863' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyType_FromModuleAndSpec' mangled-name='PyType_FromModuleAndSpec' filepath='Objects/typeobject.c' line='4884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_FromModuleAndSpec'>
-      <parameter type-id='type-id-4' name='module' filepath='Objects/typeobject.c' line='4884' column='1'/>
-      <parameter type-id='type-id-525' name='spec' filepath='Objects/typeobject.c' line='4884' column='1'/>
-      <parameter type-id='type-id-4' name='bases' filepath='Objects/typeobject.c' line='4884' column='1'/>
+    <function-decl name='PyType_FromModuleAndSpec' mangled-name='PyType_FromModuleAndSpec' filepath='Objects/typeobject.c' line='4869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_FromModuleAndSpec'>
+      <parameter type-id='type-id-4' name='module' filepath='Objects/typeobject.c' line='4869' column='1'/>
+      <parameter type-id='type-id-525' name='spec' filepath='Objects/typeobject.c' line='4869' column='1'/>
+      <parameter type-id='type-id-4' name='bases' filepath='Objects/typeobject.c' line='4869' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyType_FromSpec' mangled-name='PyType_FromSpec' filepath='Objects/typeobject.c' line='4896' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_FromSpec'>
-      <parameter type-id='type-id-525' name='spec' filepath='Objects/typeobject.c' line='4896' column='1'/>
+    <function-decl name='PyType_FromSpec' mangled-name='PyType_FromSpec' filepath='Objects/typeobject.c' line='4881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_FromSpec'>
+      <parameter type-id='type-id-525' name='spec' filepath='Objects/typeobject.c' line='4881' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyType_GetName' mangled-name='PyType_GetName' filepath='Objects/typeobject.c' line='4902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetName'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4902' column='1'/>
+    <function-decl name='PyType_GetName' mangled-name='PyType_GetName' filepath='Objects/typeobject.c' line='4887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetName'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4887' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyType_GetModuleName' mangled-name='PyType_GetModuleName' filepath='Objects/typeobject.c' line='4914' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModuleName'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4914' column='1'/>
+    <function-decl name='PyType_GetModuleName' mangled-name='PyType_GetModuleName' filepath='Objects/typeobject.c' line='4899' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModuleName'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4899' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyType_GetSlot' mangled-name='PyType_GetSlot' filepath='Objects/typeobject.c' line='4920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetSlot'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4920' column='1'/>
-      <parameter type-id='type-id-5' name='slot' filepath='Objects/typeobject.c' line='4920' column='1'/>
+    <function-decl name='PyType_GetSlot' mangled-name='PyType_GetSlot' filepath='Objects/typeobject.c' line='4905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetSlot'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4905' column='1'/>
+      <parameter type-id='type-id-5' name='slot' filepath='Objects/typeobject.c' line='4905' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='PyType_GetModule' mangled-name='PyType_GetModule' filepath='Objects/typeobject.c' line='4942' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModule'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4942' column='1'/>
+    <function-decl name='PyType_GetModule' mangled-name='PyType_GetModule' filepath='Objects/typeobject.c' line='4927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModule'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4927' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyType_GetModuleState' mangled-name='PyType_GetModuleState' filepath='Objects/typeobject.c' line='4966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModuleState'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4966' column='1'/>
+    <function-decl name='PyType_GetModuleState' mangled-name='PyType_GetModuleState' filepath='Objects/typeobject.c' line='4951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModuleState'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='4951' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='PyType_GetModuleByDef' mangled-name='PyType_GetModuleByDef' filepath='Objects/typeobject.c' line='5030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModuleByDef'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='5030' column='1'/>
-      <parameter type-id='type-id-386' name='def' filepath='Objects/typeobject.c' line='5030' column='1'/>
+    <function-decl name='PyType_GetModuleByDef' mangled-name='PyType_GetModuleByDef' filepath='Objects/typeobject.c' line='5015' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetModuleByDef'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='5015' column='1'/>
+      <parameter type-id='type-id-386' name='def' filepath='Objects/typeobject.c' line='5015' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyType_GetModuleByDef2' mangled-name='_PyType_GetModuleByDef2' filepath='Objects/typeobject.c' line='5043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_GetModuleByDef2'>
-      <parameter type-id='type-id-1' name='left' filepath='Objects/typeobject.c' line='5043' column='1'/>
-      <parameter type-id='type-id-1' name='right' filepath='Objects/typeobject.c' line='5043' column='1'/>
-      <parameter type-id='type-id-386' name='def' filepath='Objects/typeobject.c' line='5044' column='1'/>
+    <function-decl name='_PyType_GetModuleByDef2' mangled-name='_PyType_GetModuleByDef2' filepath='Objects/typeobject.c' line='5028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_GetModuleByDef2'>
+      <parameter type-id='type-id-1' name='left' filepath='Objects/typeobject.c' line='5028' column='1'/>
+      <parameter type-id='type-id-1' name='right' filepath='Objects/typeobject.c' line='5028' column='1'/>
+      <parameter type-id='type-id-386' name='def' filepath='Objects/typeobject.c' line='5029' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyType_GetModuleByDef3' mangled-name='_PyType_GetModuleByDef3' filepath='Objects/typeobject.c' line='5060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_GetModuleByDef3'>
-      <parameter type-id='type-id-1' name='left' filepath='Objects/typeobject.c' line='5060' column='1'/>
-      <parameter type-id='type-id-1' name='right' filepath='Objects/typeobject.c' line='5060' column='1'/>
-      <parameter type-id='type-id-1' name='third' filepath='Objects/typeobject.c' line='5060' column='1'/>
-      <parameter type-id='type-id-386' name='def' filepath='Objects/typeobject.c' line='5061' column='1'/>
+    <function-decl name='_PyType_GetModuleByDef3' mangled-name='_PyType_GetModuleByDef3' filepath='Objects/typeobject.c' line='5045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_GetModuleByDef3'>
+      <parameter type-id='type-id-1' name='left' filepath='Objects/typeobject.c' line='5045' column='1'/>
+      <parameter type-id='type-id-1' name='right' filepath='Objects/typeobject.c' line='5045' column='1'/>
+      <parameter type-id='type-id-1' name='third' filepath='Objects/typeobject.c' line='5045' column='1'/>
+      <parameter type-id='type-id-386' name='def' filepath='Objects/typeobject.c' line='5046' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='PyObject_GetTypeData' mangled-name='PyObject_GetTypeData' filepath='Objects/typeobject.c' line='5080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetTypeData'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/typeobject.c' line='5080' column='1'/>
-      <parameter type-id='type-id-1' name='cls' filepath='Objects/typeobject.c' line='5080' column='1'/>
+    <function-decl name='PyObject_GetTypeData' mangled-name='PyObject_GetTypeData' filepath='Objects/typeobject.c' line='5065' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetTypeData'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/typeobject.c' line='5065' column='1'/>
+      <parameter type-id='type-id-1' name='cls' filepath='Objects/typeobject.c' line='5065' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='PyType_GetTypeDataSize' mangled-name='PyType_GetTypeDataSize' filepath='Objects/typeobject.c' line='5087' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetTypeDataSize'>
-      <parameter type-id='type-id-1' name='cls' filepath='Objects/typeobject.c' line='5087' column='1'/>
+    <function-decl name='PyType_GetTypeDataSize' mangled-name='PyType_GetTypeDataSize' filepath='Objects/typeobject.c' line='5072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GetTypeDataSize'>
+      <parameter type-id='type-id-1' name='cls' filepath='Objects/typeobject.c' line='5072' column='1'/>
       <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='PyObject_GetItemData' mangled-name='PyObject_GetItemData' filepath='Objects/typeobject.c' line='5097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItemData'>
-      <parameter type-id='type-id-4' name='obj' filepath='Objects/typeobject.c' line='5097' column='1'/>
+    <function-decl name='PyObject_GetItemData' mangled-name='PyObject_GetItemData' filepath='Objects/typeobject.c' line='5082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItemData'>
+      <parameter type-id='type-id-4' name='obj' filepath='Objects/typeobject.c' line='5082' column='1'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='_PyType_Lookup' mangled-name='_PyType_Lookup' filepath='Objects/typeobject.c' line='5342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_Lookup'>
-      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='5342' column='1'/>
-      <parameter type-id='type-id-4' name='name' filepath='Objects/typeobject.c' line='5342' column='1'/>
+    <function-decl name='_PyType_Lookup' mangled-name='_PyType_Lookup' filepath='Objects/typeobject.c' line='5327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyType_Lookup'>
+      <parameter type-id='type-id-1' name='type' filepath='Objects/typeobject.c' line='5327' column='1'/>
+      <parameter type-id='type-id-4' name='name' filepath='Objects/typeobject.c' line='5327' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='_PyStaticType_InitForExtension' mangled-name='_PyStaticType_InitForExtension' filepath='Objects/typeobject.c' line='8356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStaticType_InitForExtension'>
-      <parameter type-id='type-id-28' name='interp' filepath='Objects/typeobject.c' line='8356' column='1'/>
-      <parameter type-id='type-id-1' name='self' filepath='Objects/typeobject.c' line='8356' column='1'/>
+    <function-decl name='_PyStaticType_InitForExtension' mangled-name='_PyStaticType_InitForExtension' filepath='Objects/typeobject.c' line='8346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStaticType_InitForExtension'>
+      <parameter type-id='type-id-28' name='interp' filepath='Objects/typeobject.c' line='8346' column='1'/>
+      <parameter type-id='type-id-1' name='self' filepath='Objects/typeobject.c' line='8346' column='1'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PySuper_Lookup' mangled-name='_PySuper_Lookup' filepath='Objects/typeobject.c' line='11319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySuper_Lookup'>
-      <parameter type-id='type-id-1' name='su_type' filepath='Objects/typeobject.c' line='11319' column='1'/>
-      <parameter type-id='type-id-4' name='su_obj' filepath='Objects/typeobject.c' line='11319' column='1'/>
-      <parameter type-id='type-id-4' name='name' filepath='Objects/typeobject.c' line='11319' column='1'/>
-      <parameter type-id='type-id-175' name='method' filepath='Objects/typeobject.c' line='11319' column='1'/>
+    <function-decl name='_PySuper_Lookup' mangled-name='_PySuper_Lookup' filepath='Objects/typeobject.c' line='11308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySuper_Lookup'>
+      <parameter type-id='type-id-1' name='su_type' filepath='Objects/typeobject.c' line='11308' column='1'/>
+      <parameter type-id='type-id-4' name='su_obj' filepath='Objects/typeobject.c' line='11308' column='1'/>
+      <parameter type-id='type-id-4' name='name' filepath='Objects/typeobject.c' line='11308' column='1'/>
+      <parameter type-id='type-id-175' name='method' filepath='Objects/typeobject.c' line='11308' column='1'/>
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/typevarobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/typevarobject.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyArg_UnpackKeywordsWithVararg' mangled-name='_PyArg_UnpackKeywordsWithVararg' filepath='./Include/internal/pycore_modsupport.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_UnpackKeywordsWithVararg'>
       <parameter type-id='type-id-255'/>
       <parameter type-id='type-id-7'/>
@@ -10005,7 +10000,7 @@
     <var-decl name='_PyNoDefault_Type' type-id='type-id-263' visibility='default' filepath='./Include/internal/pycore_typevarobject.h' line='21' column='1'/>
     <var-decl name='_Py_NoDefaultStruct' type-id='type-id-353' visibility='default' filepath='./Include/internal/pycore_typevarobject.h' line='22' column='1'/>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/unicodectype.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/unicodectype.c' comp-dir-path='/src' language='LANG_C11'>
     <function-decl name='_PyUnicode_ToTitlecase' mangled-name='_PyUnicode_ToTitlecase' filepath='Objects/unicodectype.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyUnicode_ToTitlecase'>
       <parameter type-id='type-id-256' name='ch' filepath='Objects/unicodectype.c' line='62' column='1'/>
       <return type-id='type-id-256'/>
@@ -10027,7 +10022,7 @@
       <return type-id='type-id-170'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/unicodeobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/unicodeobject.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-370' size-in-bits='1024' id='type-id-529'>
       <subrange length='128' type-id='type-id-2' id='type-id-530'/>
     </array-type-def>
@@ -10689,7 +10684,7 @@
       <enumerator name='_PyStatus_TYPE_EXIT' value='2'/>
     </enum-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/unionobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/unionobject.c' comp-dir-path='/src' language='LANG_C11'>
     <var-decl name='_PyUnion_Type' type-id='type-id-263' mangled-name='_PyUnion_Type' visibility='default' filepath='./Include/internal/pycore_unionobject.h' line='12' column='1' elf-symbol-id='_PyUnion_Type'/>
     <function-decl name='_Py_subs_parameters' filepath='./Include/internal/pycore_unionobject.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
@@ -10703,7 +10698,7 @@
       <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Objects/weakrefobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Objects/weakrefobject.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='_PyWeakReference' size-in-bits='512' is-struct='yes' visibility='default' filepath='./Include/cpython/weakrefobject.h' line='8' column='1' id='type-id-546'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='ob_base' type-id='type-id-353' visibility='default' filepath='./Include/cpython/weakrefobject.h' line='9' column='1'/>
@@ -10759,7 +10754,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Parser/action_helpers.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Parser/action_helpers.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-549' size-in-bits='64' id='type-id-550'>
       <subrange length='1' type-id='type-id-2' id='type-id-428'/>
     </array-type-def>
@@ -11892,8 +11887,8 @@
       </data-member>
     </class-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Parser/lexer/lexer.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
-    <function-decl name='_Py_FatalErrorFunc' mangled-name='_Py_FatalErrorFunc' filepath='./Include/cpython/pyerrors.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FatalErrorFunc'>
+  <abi-instr address-size='64' path='Parser/lexer/lexer.c' comp-dir-path='/src' language='LANG_C11'>
+    <function-decl name='_Py_FatalErrorFunc' mangled-name='_Py_FatalErrorFunc' filepath='./Include/cpython/pyerrors.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FatalErrorFunc'>
       <parameter type-id='type-id-6'/>
       <parameter type-id='type-id-6'/>
       <return type-id='type-id-3'/>
@@ -11958,7 +11953,7 @@
       <parameter is-variadic='yes'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyLexer_type_comment_token_setup' filepath='Parser/lexer/state.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyLexer_type_comment_token_setup' filepath='Parser/lexer/state.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-676'/>
       <parameter type-id='type-id-677'/>
       <parameter type-id='type-id-5'/>
@@ -11968,7 +11963,7 @@
       <parameter type-id='type-id-6'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='_PyLexer_token_setup' filepath='Parser/lexer/state.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='_PyLexer_token_setup' filepath='Parser/lexer/state.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-676'/>
       <parameter type-id='type-id-677'/>
       <parameter type-id='type-id-5'/>
@@ -11977,7 +11972,7 @@
       <return type-id='type-id-5'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Parser/myreadline.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Parser/myreadline.c' comp-dir-path='/src' language='LANG_C11'>
     <qualified-type-def type-id='type-id-56' restrict='yes' id='type-id-401'/>
     <pointer-type-def type-id='type-id-678' size-in-bits='64' id='type-id-26'/>
     <pointer-type-def type-id='type-id-679' size-in-bits='64' id='type-id-680'/>
@@ -12049,7 +12044,7 @@
       <return type-id='type-id-5'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Parser/parser.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Parser/parser.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='asdl_seq' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-683' visibility='default' filepath='./Include/internal/pycore_asdl.h' line='28' column='1' id='type-id-684'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='size' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_asdl.h' line='29' column='1'/>
@@ -12175,150 +12170,150 @@
     <pointer-type-def type-id='type-id-719' size-in-bits='64' id='type-id-720'/>
     <pointer-type-def type-id='type-id-721' size-in-bits='64' id='type-id-722'/>
     <pointer-type-def type-id='type-id-723' size-in-bits='64' id='type-id-724'/>
-    <class-decl name='tok_state' size-in-bits='138176' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='68' column='1' id='type-id-725'>
+    <class-decl name='tok_state' size-in-bits='138176' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='66' column='1' id='type-id-725'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='buf' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='71' column='1'/>
+        <var-decl name='buf' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='69' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='cur' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='72' column='1'/>
+        <var-decl name='cur' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='inp' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='73' column='1'/>
+        <var-decl name='inp' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='fp_interactive' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='74' column='1'/>
+        <var-decl name='fp_interactive' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='interactive_src_start' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='75' column='1'/>
+        <var-decl name='interactive_src_start' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='73' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='interactive_src_end' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='76' column='1'/>
+        <var-decl name='interactive_src_end' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='74' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='end' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='77' column='1'/>
+        <var-decl name='end' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='75' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='78' column='1'/>
+        <var-decl name='start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='76' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='done' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='79' column='1'/>
+        <var-decl name='done' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='77' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='fp' type-id='type-id-56' visibility='default' filepath='Parser/lexer/state.h' line='81' column='1'/>
+        <var-decl name='fp' type-id='type-id-56' visibility='default' filepath='Parser/lexer/state.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='tabsize' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='82' column='1'/>
+        <var-decl name='tabsize' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='672'>
-        <var-decl name='indent' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='83' column='1'/>
+        <var-decl name='indent' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='81' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='indstack' type-id='type-id-726' visibility='default' filepath='Parser/lexer/state.h' line='84' column='1'/>
+        <var-decl name='indstack' type-id='type-id-726' visibility='default' filepath='Parser/lexer/state.h' line='82' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3904'>
-        <var-decl name='atbol' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='85' column='1'/>
+        <var-decl name='atbol' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='83' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3936'>
-        <var-decl name='pendin' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='86' column='1'/>
+        <var-decl name='pendin' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='84' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3968'>
-        <var-decl name='prompt' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='87' column='1'/>
+        <var-decl name='prompt' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='85' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4032'>
-        <var-decl name='nextprompt' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='87' column='1'/>
+        <var-decl name='nextprompt' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='85' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4096'>
-        <var-decl name='lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='88' column='1'/>
+        <var-decl name='lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='86' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4128'>
-        <var-decl name='first_lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='89' column='1'/>
+        <var-decl name='first_lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='87' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4160'>
-        <var-decl name='starting_col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='91' column='1'/>
+        <var-decl name='starting_col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='89' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4192'>
-        <var-decl name='col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='92' column='1'/>
+        <var-decl name='col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='90' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4224'>
-        <var-decl name='level' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='93' column='1'/>
+        <var-decl name='level' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='91' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4256'>
-        <var-decl name='parenstack' type-id='type-id-727' visibility='default' filepath='Parser/lexer/state.h' line='95' column='1'/>
+        <var-decl name='parenstack' type-id='type-id-727' visibility='default' filepath='Parser/lexer/state.h' line='93' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5856'>
-        <var-decl name='parenlinenostack' type-id='type-id-728' visibility='default' filepath='Parser/lexer/state.h' line='96' column='1'/>
+        <var-decl name='parenlinenostack' type-id='type-id-728' visibility='default' filepath='Parser/lexer/state.h' line='94' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='12256'>
-        <var-decl name='parencolstack' type-id='type-id-728' visibility='default' filepath='Parser/lexer/state.h' line='97' column='1'/>
+        <var-decl name='parencolstack' type-id='type-id-728' visibility='default' filepath='Parser/lexer/state.h' line='95' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='18688'>
-        <var-decl name='filename' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='98' column='1'/>
+        <var-decl name='filename' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='96' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='18752'>
-        <var-decl name='altindstack' type-id='type-id-726' visibility='default' filepath='Parser/lexer/state.h' line='100' column='1'/>
+        <var-decl name='altindstack' type-id='type-id-726' visibility='default' filepath='Parser/lexer/state.h' line='98' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='21952'>
-        <var-decl name='decoding_state' type-id='type-id-729' visibility='default' filepath='Parser/lexer/state.h' line='102' column='1'/>
+        <var-decl name='decoding_state' type-id='type-id-729' visibility='default' filepath='Parser/lexer/state.h' line='100' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='21984'>
-        <var-decl name='decoding_erred' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='103' column='1'/>
+        <var-decl name='decoding_erred' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='101' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22016'>
-        <var-decl name='encoding' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='104' column='1'/>
+        <var-decl name='encoding' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='102' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22080'>
-        <var-decl name='cont_line' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='105' column='1'/>
+        <var-decl name='cont_line' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='103' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22144'>
-        <var-decl name='line_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='106' column='1'/>
+        <var-decl name='line_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='104' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22208'>
-        <var-decl name='multi_line_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='107' column='1'/>
+        <var-decl name='multi_line_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='105' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22272'>
-        <var-decl name='decoding_readline' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='110' column='1'/>
+        <var-decl name='decoding_readline' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='108' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22336'>
-        <var-decl name='decoding_buffer' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='111' column='1'/>
+        <var-decl name='decoding_buffer' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='109' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22400'>
-        <var-decl name='readline' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='112' column='1'/>
+        <var-decl name='readline' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='110' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22464'>
-        <var-decl name='enc' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='113' column='1'/>
+        <var-decl name='enc' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='111' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22528'>
-        <var-decl name='str' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='114' column='1'/>
+        <var-decl name='str' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='112' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22592'>
-        <var-decl name='input' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='115' column='1'/>
+        <var-decl name='input' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='113' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22656'>
-        <var-decl name='type_comments' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='117' column='1'/>
+        <var-decl name='type_comments' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='115' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22688'>
-        <var-decl name='interactive_underflow' type-id='type-id-730' visibility='default' filepath='Parser/lexer/state.h' line='120' column='1'/>
+        <var-decl name='interactive_underflow' type-id='type-id-730' visibility='default' filepath='Parser/lexer/state.h' line='118' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22720'>
-        <var-decl name='underflow' type-id='type-id-731' visibility='default' filepath='Parser/lexer/state.h' line='121' column='1'/>
+        <var-decl name='underflow' type-id='type-id-731' visibility='default' filepath='Parser/lexer/state.h' line='119' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22784'>
-        <var-decl name='report_warnings' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='123' column='1'/>
+        <var-decl name='report_warnings' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='121' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='22848'>
-        <var-decl name='tok_mode_stack' type-id='type-id-732' visibility='default' filepath='Parser/lexer/state.h' line='125' column='1'/>
+        <var-decl name='tok_mode_stack' type-id='type-id-732' visibility='default' filepath='Parser/lexer/state.h' line='123' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='138048'>
-        <var-decl name='tok_mode_stack_index' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='126' column='1'/>
+        <var-decl name='tok_mode_stack_index' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='124' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='138080'>
-        <var-decl name='tok_extra_tokens' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='127' column='1'/>
+        <var-decl name='tok_extra_tokens' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='125' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='138112'>
-        <var-decl name='comment_newline' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='128' column='1'/>
+        <var-decl name='comment_newline' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='126' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='138144'>
-        <var-decl name='implicit_newline' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='129' column='1'/>
+        <var-decl name='implicit_newline' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='127' column='1'/>
       </data-member>
     </class-decl>
     <function-decl name='_PyAST_Interactive' filepath='./Include/internal/pycore_ast.h' line='684' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -13346,7 +13341,7 @@
       <return type-id='type-id-30'/>
     </function-type>
   </abi-instr>
-  <abi-instr address-size='64' path='Parser/peg_api.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Parser/peg_api.c' comp-dir-path='/src' language='LANG_C11'>
     <class-decl name='PyCompilerFlags' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-738' visibility='default' filepath='./Include/cpython/compile.h' line='27' column='1' id='type-id-739'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='cf_flags' type-id='type-id-5' visibility='default' filepath='./Include/cpython/compile.h' line='28' column='1'/>
@@ -13385,7 +13380,7 @@
       <return type-id='type-id-573'/>
     </function-decl>
   </abi-instr>
-  <abi-instr address-size='64' path='Parser/pegen.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C11'>
+  <abi-instr address-size='64' path='Parser/pegen.c' comp-dir-path='/src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-740' size-in-bits='512' id='type-id-741'>
       <subrange length='8' type-id='type-id-2' id='type-id-515'/>
     </array-type-def>
@@ -13444,10 +13439,10 @@
     <array-type-def dimensions='1' type-id='type-id-766' size-in-bits='128' id='type-id-767'>
       <subrange length='1' type-id='type-id-2' id='type-id-428'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-768' size-in-bits='65536' id='type-id-769'>
+    <array-type-def dimensions='1' type-id='type-id-768' size-in-bits='49152' id='type-id-769'>
       <subrange length='128' type-id='type-id-2' id='type-id-530'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-770' size-in-bits='49152' id='type-id-771'>
+    <array-type-def dimensions='1' type-id='type-id-770' size-in-bits='65536' id='type-id-771'>
       <subrange length='128' type-id='type-id-2' id='type-id-530'/>
     </array-type-def>
     <array-type-def dimensions='1' type-id='type-id-772' size-in-bits='26880' id='type-id-773'>
@@ -14713,29 +14708,29 @@
         <var-decl name='tp_del' type-id='type-id-979' visibility='default' filepath='./Include/cpython/object.h' line='222' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3072'>
-        <var-decl name='tp_version_tag' type-id='type-id-99' visibility='default' filepath='./Include/cpython/object.h' line='227' column='1'/>
+        <var-decl name='tp_version_tag' type-id='type-id-99' visibility='default' filepath='./Include/cpython/object.h' line='225' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3136'>
-        <var-decl name='tp_finalize' type-id='type-id-979' visibility='default' filepath='./Include/cpython/object.h' line='229' column='1'/>
+        <var-decl name='tp_finalize' type-id='type-id-979' visibility='default' filepath='./Include/cpython/object.h' line='227' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3200'>
-        <var-decl name='tp_vectorcall' type-id='type-id-306' visibility='default' filepath='./Include/cpython/object.h' line='230' column='1'/>
+        <var-decl name='tp_vectorcall' type-id='type-id-306' visibility='default' filepath='./Include/cpython/object.h' line='228' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3264'>
-        <var-decl name='tp_watched' type-id='type-id-89' visibility='default' filepath='./Include/cpython/object.h' line='233' column='1'/>
+        <var-decl name='tp_watched' type-id='type-id-89' visibility='default' filepath='./Include/cpython/object.h' line='231' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3280'>
-        <var-decl name='tp_versions_used' type-id='type-id-443' visibility='default' filepath='./Include/cpython/object.h' line='240' column='1'/>
+        <var-decl name='tp_versions_used' type-id='type-id-443' visibility='default' filepath='./Include/cpython/object.h' line='232' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='PyType_WatchCallback' type-id='type-id-999' filepath='./Include/cpython/object.h' line='514' column='1' id='type-id-528'/>
-    <enum-decl name='PyRefTracerEvent' naming-typedef-id='type-id-1000' filepath='./Include/cpython/object.h' line='528' column='1' id='type-id-1001'>
+    <typedef-decl name='PyType_WatchCallback' type-id='type-id-999' filepath='./Include/cpython/object.h' line='504' column='1' id='type-id-528'/>
+    <enum-decl name='PyRefTracerEvent' naming-typedef-id='type-id-1000' filepath='./Include/cpython/object.h' line='518' column='1' id='type-id-1001'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='PyRefTracer_CREATE' value='0'/>
       <enumerator name='PyRefTracer_DESTROY' value='1'/>
     </enum-decl>
-    <typedef-decl name='PyRefTracerEvent' type-id='type-id-1001' filepath='./Include/cpython/object.h' line='531' column='1' id='type-id-1000'/>
-    <typedef-decl name='PyRefTracer' type-id='type-id-1002' filepath='./Include/cpython/object.h' line='533' column='1' id='type-id-402'/>
+    <typedef-decl name='PyRefTracerEvent' type-id='type-id-1001' filepath='./Include/cpython/object.h' line='521' column='1' id='type-id-1000'/>
+    <typedef-decl name='PyRefTracer' type-id='type-id-1002' filepath='./Include/cpython/object.h' line='523' column='1' id='type-id-402'/>
     <class-decl name='PyObjectArenaAllocator' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-501' visibility='default' filepath='./Include/cpython/objimpl.h' line='59' column='1' id='type-id-1003'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='ctx' type-id='type-id-30' visibility='default' filepath='./Include/cpython/objimpl.h' line='61' column='1'/>
@@ -14819,7 +14814,7 @@
       </data-member>
     </class-decl>
     <typedef-decl name='_PyStackChunk' type-id='type-id-1016' filepath='./Include/cpython/pystate.h' line='57' column='1' id='type-id-1018'/>
-    <class-decl name='_ts' size-in-bits='2496' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='59' column='1' id='type-id-1019'>
+    <class-decl name='_ts' size-in-bits='2432' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='59' column='1' id='type-id-1019'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='prev' type-id='type-id-27' visibility='default' filepath='./Include/cpython/pystate.h' line='62' column='1'/>
       </data-member>
@@ -14943,9 +14938,6 @@
       <data-member access='public' layout-offset-in-bits='2368'>
         <var-decl name='threading_local_sentinel' type-id='type-id-4' visibility='default' filepath='./Include/cpython/pystate.h' line='202' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='2432'>
-        <var-decl name='datastack_cached_chunk' type-id='type-id-1021' visibility='default' filepath='./Include/cpython/pystate.h' line='204' column='1'/>
-      </data-member>
     </class-decl>
     <class-decl name='__anonymous_struct__28' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='71' column='1' id='type-id-1020'>
       <data-member access='public' layout-offset-in-bits='0'>
@@ -14976,7 +14968,7 @@
         <var-decl name='finalized' type-id='type-id-99' visibility='default' filepath='./Include/cpython/pystate.h' line='92' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-1022' filepath='./Include/cpython/pystate.h' line='273' column='1' id='type-id-1023'/>
+    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-1022' filepath='./Include/cpython/pystate.h' line='271' column='1' id='type-id-1023'/>
     <class-decl name='_Py_tss_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='./Include/cpython/pythread.h' line='35' column='1' id='type-id-1024'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='_is_initialized' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pythread.h' line='36' column='1'/>
@@ -16463,18 +16455,18 @@
         <var-decl name='code_padding' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='78' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='_ceval_runtime_state' size-in-bits='58752' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='83' column='1' id='type-id-1106'>
+    <class-decl name='_ceval_runtime_state' size-in-bits='58560' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='83' column='1' id='type-id-1106'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='perf' type-id='type-id-1107' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='99' column='1'/>
+        <var-decl name='perf' type-id='type-id-1107' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='96' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='pending_mainthread' type-id='type-id-1099' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='105' column='1'/>
+      <data-member access='public' layout-offset-in-bits='640'>
+        <var-decl name='pending_mainthread' type-id='type-id-1099' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='102' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='58688'>
-        <var-decl name='sys_trace_profile_mutex' type-id='type-id-678' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='106' column='1'/>
+      <data-member access='public' layout-offset-in-bits='58496'>
+        <var-decl name='sys_trace_profile_mutex' type-id='type-id-678' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='103' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__39' size-in-bits='832' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='84' column='1' id='type-id-1107'>
+    <class-decl name='__anonymous_struct__39' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='84' column='1' id='type-id-1107'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='status' type-id='type-id-1101' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='86' column='1'/>
       </data-member>
@@ -16496,31 +16488,22 @@
       <data-member access='public' layout-offset-in-bits='576'>
         <var-decl name='persist_after_fork' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='92' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='prev_eval_frame' type-id='type-id-1023' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='93' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='trampoline_refcount' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='94' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='768'>
-        <var-decl name='code_watcher_id' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='95' column='1'/>
-      </data-member>
     </class-decl>
-    <class-decl name='_ceval_state' size-in-bits='58112' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='122' column='1' id='type-id-1109'>
+    <class-decl name='_ceval_state' size-in-bits='58112' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='119' column='1' id='type-id-1109'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='instrumentation_version' type-id='type-id-426' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='126' column='1'/>
+        <var-decl name='instrumentation_version' type-id='type-id-426' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='123' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='recursion_limit' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='127' column='1'/>
+        <var-decl name='recursion_limit' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='124' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='gil' type-id='type-id-1110' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='128' column='1'/>
+        <var-decl name='gil' type-id='type-id-1110' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='125' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='own_gil' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='129' column='1'/>
+        <var-decl name='own_gil' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='126' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='pending' type-id='type-id-1099' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='130' column='1'/>
+        <var-decl name='pending' type-id='type-id-1099' visibility='default' filepath='./Include/internal/pycore_ceval_state.h' line='127' column='1'/>
       </data-member>
     </class-decl>
     <union-decl name='_Py_CODEUNIT' size-in-bits='16' naming-typedef-id='type-id-1111' visibility='default' filepath='./Include/internal/pycore_code.h' line='24' column='1' id='type-id-1112'>
@@ -16852,74 +16835,74 @@
         <var-decl name='double_format' type-id='type-id-1148' visibility='default' filepath='./Include/internal/pycore_floatobject.h' line='31' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='_frame' size-in-bits='576' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_frame.h' line='21' column='1' id='type-id-1150'>
+    <class-decl name='_frame' size-in-bits='576' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_frame.h' line='20' column='1' id='type-id-1150'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='ob_base' type-id='type-id-353' visibility='default' filepath='./Include/internal/pycore_frame.h' line='22' column='1'/>
+        <var-decl name='ob_base' type-id='type-id-353' visibility='default' filepath='./Include/internal/pycore_frame.h' line='21' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='f_back' type-id='type-id-348' visibility='default' filepath='./Include/internal/pycore_frame.h' line='23' column='1'/>
+        <var-decl name='f_back' type-id='type-id-348' visibility='default' filepath='./Include/internal/pycore_frame.h' line='22' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='f_frame' type-id='type-id-366' visibility='default' filepath='./Include/internal/pycore_frame.h' line='24' column='1'/>
+        <var-decl name='f_frame' type-id='type-id-366' visibility='default' filepath='./Include/internal/pycore_frame.h' line='23' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='f_trace' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='25' column='1'/>
+        <var-decl name='f_trace' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='24' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='f_lineno' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='26' column='1'/>
+        <var-decl name='f_lineno' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='25' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='352'>
-        <var-decl name='f_trace_lines' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_frame.h' line='27' column='1'/>
+        <var-decl name='f_trace_lines' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_frame.h' line='26' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='360'>
-        <var-decl name='f_trace_opcodes' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_frame.h' line='28' column='1'/>
+        <var-decl name='f_trace_opcodes' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_frame.h' line='27' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='f_extra_locals' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='29' column='1'/>
+        <var-decl name='f_extra_locals' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='28' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='f_locals_cache' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='33' column='1'/>
+        <var-decl name='f_locals_cache' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='32' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='_f_frame_data' type-id='type-id-356' visibility='default' filepath='./Include/internal/pycore_frame.h' line='35' column='1'/>
+        <var-decl name='_f_frame_data' type-id='type-id-356' visibility='default' filepath='./Include/internal/pycore_frame.h' line='34' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='_PyInterpreterFrame' size-in-bits='640' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_frame.h' line='62' column='1' id='type-id-359'>
+    <class-decl name='_PyInterpreterFrame' size-in-bits='640' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_frame.h' line='61' column='1' id='type-id-359'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='f_executable' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='63' column='1'/>
+        <var-decl name='f_executable' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='previous' type-id='type-id-366' visibility='default' filepath='./Include/internal/pycore_frame.h' line='64' column='1'/>
+        <var-decl name='previous' type-id='type-id-366' visibility='default' filepath='./Include/internal/pycore_frame.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='f_funcobj' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='65' column='1'/>
+        <var-decl name='f_funcobj' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='64' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='f_globals' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='66' column='1'/>
+        <var-decl name='f_globals' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='65' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='f_builtins' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='67' column='1'/>
+        <var-decl name='f_builtins' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='66' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='f_locals' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='68' column='1'/>
+        <var-decl name='f_locals' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='67' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='frame_obj' type-id='type-id-348' visibility='default' filepath='./Include/internal/pycore_frame.h' line='69' column='1'/>
+        <var-decl name='frame_obj' type-id='type-id-348' visibility='default' filepath='./Include/internal/pycore_frame.h' line='68' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='instr_ptr' type-id='type-id-1151' visibility='default' filepath='./Include/internal/pycore_frame.h' line='70' column='1'/>
+        <var-decl name='instr_ptr' type-id='type-id-1151' visibility='default' filepath='./Include/internal/pycore_frame.h' line='69' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='stacktop' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='71' column='1'/>
+        <var-decl name='stacktop' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='544'>
-        <var-decl name='return_offset' type-id='type-id-443' visibility='default' filepath='./Include/internal/pycore_frame.h' line='72' column='1'/>
+        <var-decl name='return_offset' type-id='type-id-443' visibility='default' filepath='./Include/internal/pycore_frame.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='560'>
-        <var-decl name='owner' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_frame.h' line='73' column='1'/>
+        <var-decl name='owner' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_frame.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='localsplus' type-id='type-id-356' visibility='default' filepath='./Include/internal/pycore_frame.h' line='75' column='1'/>
+        <var-decl name='localsplus' type-id='type-id-356' visibility='default' filepath='./Include/internal/pycore_frame.h' line='74' column='1'/>
       </data-member>
     </class-decl>
     <class-decl name='_Py_list_freelist' size-in-bits='5184' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_freelist.h' line='36' column='1' id='type-id-405'>
@@ -17254,10 +17237,10 @@
         <var-decl name='identifiers' type-id='type-id-1172' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='774' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='315136'>
-        <var-decl name='ascii' type-id='type-id-771' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='778' column='1'/>
+        <var-decl name='ascii' type-id='type-id-769' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='778' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='364288'>
-        <var-decl name='latin1' type-id='type-id-769' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='782' column='1'/>
+        <var-decl name='latin1' type-id='type-id-771' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='782' column='1'/>
       </data-member>
     </class-decl>
     <class-decl name='__anonymous_struct__57' size-in-bits='9472' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='30' column='1' id='type-id-1171'>
@@ -19708,7 +19691,7 @@
         <var-decl name='_data' type-id='type-id-881' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='717' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__800' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='775' column='1' id='type-id-770'>
+    <class-decl name='__anonymous_struct__800' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='775' column='1' id='type-id-768'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='_ascii' type-id='type-id-1028' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='776' column='1'/>
       </data-member>
@@ -19716,7 +19699,7 @@
         <var-decl name='_data' type-id='type-id-882' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='777' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__801' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='779' column='1' id='type-id-768'>
+    <class-decl name='__anonymous_struct__801' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='779' column='1' id='type-id-770'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='_latin1' type-id='type-id-1031' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='780' column='1'/>
       </data-member>
@@ -19935,7 +19918,7 @@
       </data-member>
     </class-decl>
     <typedef-decl name='_rare_events' type-id='type-id-1232' filepath='./Include/internal/pycore_interp.h' line='85' column='1' id='type-id-1233'/>
-    <class-decl name='_is' size-in-bits='1559872' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='94' column='1' id='type-id-1234'>
+    <class-decl name='_is' size-in-bits='1559808' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='94' column='1' id='type-id-1234'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='ceval' type-id='type-id-1109' visibility='default' filepath='./Include/internal/pycore_interp.h' line='99' column='1'/>
       </data-member>
@@ -20146,10 +20129,10 @@
       <data-member access='public' layout-offset-in-bits='1556992'>
         <var-decl name='_initial_thread' type-id='type-id-1245' visibility='default' filepath='./Include/internal/pycore_interp.h' line='276' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='1559744'>
+      <data-member access='public' layout-offset-in-bits='1559680'>
         <var-decl name='_interactive_src_count' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_interp.h' line='277' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='1559808'>
+      <data-member access='public' layout-offset-in-bits='1559744'>
         <var-decl name='threads_preallocated' type-id='type-id-1246' visibility='default' filepath='./Include/internal/pycore_interp.h' line='279' column='1'/>
       </data-member>
     </class-decl>
@@ -21001,7 +20984,7 @@
         <var-decl name='tracer_data' type-id='type-id-30' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='200' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='pyruntimestate' size-in-bits='2267264' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='208' column='1' id='type-id-475'>
+    <class-decl name='pyruntimestate' size-in-bits='2267008' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='208' column='1' id='type-id-475'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='debug_offsets' type-id='type-id-1332' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='221' column='1'/>
       </data-member>
@@ -21074,61 +21057,61 @@
       <data-member access='public' layout-offset-in-bits='20480'>
         <var-decl name='ceval' type-id='type-id-1106' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='301' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='79232'>
+      <data-member access='public' layout-offset-in-bits='79040'>
         <var-decl name='gilstate' type-id='type-id-1312' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='302' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='79360'>
+      <data-member access='public' layout-offset-in-bits='79168'>
         <var-decl name='getargs' type-id='type-id-1311' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='303' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='79424'>
+      <data-member access='public' layout-offset-in-bits='79232'>
         <var-decl name='fileutils' type-id='type-id-1146' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='304' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='79488'>
+      <data-member access='public' layout-offset-in-bits='79296'>
         <var-decl name='faulthandler' type-id='type-id-1141' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='305' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='80832'>
+      <data-member access='public' layout-offset-in-bits='80640'>
         <var-decl name='tracemalloc' type-id='type-id-1337' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='306' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='82688'>
+      <data-member access='public' layout-offset-in-bits='82496'>
         <var-decl name='ref_tracer' type-id='type-id-1333' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='307' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='82816'>
+      <data-member access='public' layout-offset-in-bits='82624'>
         <var-decl name='stoptheworld_mutex' type-id='type-id-1251' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='313' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='82880'>
+      <data-member access='public' layout-offset-in-bits='82688'>
         <var-decl name='stoptheworld' type-id='type-id-1230' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='314' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83072'>
+      <data-member access='public' layout-offset-in-bits='82880'>
         <var-decl name='preconfig' type-id='type-id-945' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='316' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83392'>
+      <data-member access='public' layout-offset-in-bits='83200'>
         <var-decl name='open_code_hook' type-id='type-id-338' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='320' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83456'>
+      <data-member access='public' layout-offset-in-bits='83264'>
         <var-decl name='open_code_userdata' type-id='type-id-30' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='321' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83520'>
+      <data-member access='public' layout-offset-in-bits='83328'>
         <var-decl name='audit_hooks' type-id='type-id-1338' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='325' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83648'>
+      <data-member access='public' layout-offset-in-bits='83456'>
         <var-decl name='object_state' type-id='type-id-1254' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='327' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83680'>
+      <data-member access='public' layout-offset-in-bits='83488'>
         <var-decl name='float_state' type-id='type-id-1149' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='328' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83776'>
+      <data-member access='public' layout-offset-in-bits='83584'>
         <var-decl name='unicode_state' type-id='type-id-1339' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='329' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='83904'>
+      <data-member access='public' layout-offset-in-bits='83712'>
         <var-decl name='types' type-id='type-id-1340' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='330' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='110848'>
+      <data-member access='public' layout-offset-in-bits='110656'>
         <var-decl name='cached_objects' type-id='type-id-1162' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='333' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='110912'>
+      <data-member access='public' layout-offset-in-bits='110720'>
         <var-decl name='static_objects' type-id='type-id-1163' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='334' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='707392'>
+      <data-member access='public' layout-offset-in-bits='707200'>
         <var-decl name='_main_interpreter' type-id='type-id-1341' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='351' column='1'/>
       </data-member>
     </class-decl>
@@ -21278,17 +21261,17 @@
         <var-decl name='obj' type-id='type-id-499' visibility='default' filepath='./Include/internal/pycore_tracemalloc.h' line='74' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='_PyThreadStateImpl' size-in-bits='2752' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_tstate.h' line='20' column='1' id='type-id-1349'>
+    <class-decl name='_PyThreadStateImpl' size-in-bits='2688' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_tstate.h' line='20' column='1' id='type-id-1349'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='base' type-id='type-id-1350' visibility='default' filepath='./Include/internal/pycore_tstate.h' line='22' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='2496'>
+      <data-member access='public' layout-offset-in-bits='2432'>
         <var-decl name='asyncio_running_loop' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_tstate.h' line='24' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='2560'>
+      <data-member access='public' layout-offset-in-bits='2496'>
         <var-decl name='qsbr' type-id='type-id-507' visibility='default' filepath='./Include/internal/pycore_tstate.h' line='26' column='1'/>
       </data-member>
-      <data-member access='public' layout-offset-in-bits='2624'>
+      <data-member access='public' layout-offset-in-bits='2560'>
         <var-decl name='mem_free_queue' type-id='type-id-1247' visibility='default' filepath='./Include/internal/pycore_tstate.h' line='27' column='1'/>
       </data-member>
     </class-decl>
@@ -21531,13 +21514,13 @@
     <typedef-decl name='newfunc' type-id='type-id-1383' filepath='./Include/object.h' line='491' column='1' id='type-id-998'/>
     <typedef-decl name='allocfunc' type-id='type-id-1384' filepath='./Include/object.h' line='492' column='1' id='type-id-997'/>
     <typedef-decl name='vectorcallfunc' type-id='type-id-1385' filepath='./Include/object.h' line='495' column='1' id='type-id-306'/>
-    <enum-decl name='PySendResult' naming-typedef-id='type-id-261' filepath='./Include/object.h' line='1151' column='1' id='type-id-1386'>
+    <enum-decl name='PySendResult' naming-typedef-id='type-id-261' filepath='./Include/object.h' line='1146' column='1' id='type-id-1386'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='PYGEN_RETURN' value='0'/>
       <enumerator name='PYGEN_ERROR' value='-1'/>
       <enumerator name='PYGEN_NEXT' value='1'/>
     </enum-decl>
-    <typedef-decl name='PySendResult' type-id='type-id-1386' filepath='./Include/object.h' line='1155' column='1' id='type-id-261'/>
+    <typedef-decl name='PySendResult' type-id='type-id-1386' filepath='./Include/object.h' line='1150' column='1' id='type-id-261'/>
     <class-decl name='Py_buffer' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' filepath='./Include/pybuffer.h' line='20' column='1' id='type-id-1387'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='buf' type-id='type-id-30' visibility='default' filepath='./Include/pybuffer.h' line='21' column='1'/>
@@ -22021,243 +22004,243 @@
     <typedef-decl name='dev_t' type-id='type-id-184' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='59' column='1' id='type-id-1296'/>
     <typedef-decl name='ssize_t' type-id='type-id-183' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-182'/>
     <typedef-decl name='wchar_t' type-id='type-id-5' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='321' column='1' id='type-id-387'/>
-    <enum-decl name='decoding_state' filepath='Parser/lexer/state.h' line='16' column='1' id='type-id-729'>
+    <enum-decl name='decoding_state' filepath='Parser/lexer/state.h' line='14' column='1' id='type-id-729'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='STATE_INIT' value='0'/>
       <enumerator name='STATE_SEEK_CODING' value='1'/>
       <enumerator name='STATE_NORMAL' value='2'/>
     </enum-decl>
-    <enum-decl name='interactive_underflow_t' filepath='Parser/lexer/state.h' line='22' column='1' id='type-id-730'>
+    <enum-decl name='interactive_underflow_t' filepath='Parser/lexer/state.h' line='20' column='1' id='type-id-730'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='IUNDERFLOW_NORMAL' value='0'/>
       <enumerator name='IUNDERFLOW_STOP' value='1'/>
     </enum-decl>
-    <class-decl name='token' size-in-bits='384' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='30' column='1' id='type-id-1444'>
+    <class-decl name='token' size-in-bits='384' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='28' column='1' id='type-id-1444'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='level' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='31' column='1'/>
+        <var-decl name='level' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='29' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='32' column='1'/>
+        <var-decl name='lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='30' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='32' column='1'/>
+        <var-decl name='col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='30' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='end_lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='32' column='1'/>
+        <var-decl name='end_lineno' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='30' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='end_col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='32' column='1'/>
+        <var-decl name='end_col_offset' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='30' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='33' column='1'/>
+        <var-decl name='start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='31' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='end' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='33' column='1'/>
+        <var-decl name='end' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='31' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='metadata' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='34' column='1'/>
+        <var-decl name='metadata' type-id='type-id-4' visibility='default' filepath='Parser/lexer/state.h' line='32' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='tokenizer_mode_kind_t' filepath='Parser/lexer/state.h' line='37' column='1' id='type-id-1445'>
+    <enum-decl name='tokenizer_mode_kind_t' filepath='Parser/lexer/state.h' line='35' column='1' id='type-id-1445'>
       <underlying-type type-id='type-id-32'/>
       <enumerator name='TOK_REGULAR_MODE' value='0'/>
       <enumerator name='TOK_FSTRING_MODE' value='1'/>
     </enum-decl>
-    <class-decl name='_tokenizer_mode' size-in-bits='768' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='44' column='1' id='type-id-1446'>
+    <class-decl name='_tokenizer_mode' size-in-bits='768' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='42' column='1' id='type-id-1446'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='kind' type-id='type-id-1445' visibility='default' filepath='Parser/lexer/state.h' line='45' column='1'/>
+        <var-decl name='kind' type-id='type-id-1445' visibility='default' filepath='Parser/lexer/state.h' line='43' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='curly_bracket_depth' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='47' column='1'/>
+        <var-decl name='curly_bracket_depth' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='45' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='curly_bracket_expr_start_depth' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='48' column='1'/>
+        <var-decl name='curly_bracket_expr_start_depth' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='46' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='f_string_quote' type-id='type-id-53' visibility='default' filepath='Parser/lexer/state.h' line='50' column='1'/>
+        <var-decl name='f_string_quote' type-id='type-id-53' visibility='default' filepath='Parser/lexer/state.h' line='48' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='f_string_quote_size' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='51' column='1'/>
+        <var-decl name='f_string_quote_size' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='49' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='f_string_raw' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='52' column='1'/>
+        <var-decl name='f_string_raw' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='50' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='f_string_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='53' column='1'/>
+        <var-decl name='f_string_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='51' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='f_string_multi_line_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='54' column='1'/>
+        <var-decl name='f_string_multi_line_start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='52' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='f_string_line_start' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='55' column='1'/>
+        <var-decl name='f_string_line_start' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='53' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='f_string_start_offset' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='57' column='1'/>
+        <var-decl name='f_string_start_offset' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='55' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='f_string_multi_line_start_offset' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='58' column='1'/>
+        <var-decl name='f_string_multi_line_start_offset' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='last_expr_size' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='60' column='1'/>
+        <var-decl name='last_expr_size' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='58' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='last_expr_end' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='61' column='1'/>
+        <var-decl name='last_expr_end' type-id='type-id-7' visibility='default' filepath='Parser/lexer/state.h' line='59' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='last_expr_buffer' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='62' column='1'/>
+        <var-decl name='last_expr_buffer' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='60' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='f_string_debug' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='63' column='1'/>
+        <var-decl name='f_string_debug' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='61' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='736'>
-        <var-decl name='in_format_spec' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='64' column='1'/>
+        <var-decl name='in_format_spec' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='62' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='tokenizer_mode' type-id='type-id-1446' filepath='Parser/lexer/state.h' line='65' column='1' id='type-id-842'/>
-    <class-decl name='tok_state' size-in-bits='138176' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='68' column='1' id='type-id-725'>
+    <typedef-decl name='tokenizer_mode' type-id='type-id-1446' filepath='Parser/lexer/state.h' line='63' column='1' id='type-id-842'/>
+    <class-decl name='tok_state' size-in-bits='138176' is-struct='yes' visibility='default' filepath='Parser/lexer/state.h' line='66' column='1' id='type-id-725'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='buf' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='71' column='1'/>
+        <var-decl name='buf' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='69' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='cur' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='72' column='1'/>
+        <var-decl name='cur' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='inp' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='73' column='1'/>
+        <var-decl name='inp' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='fp_interactive' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='74' column='1'/>
+        <var-decl name='fp_interactive' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='interactive_src_start' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='75' column='1'/>
+        <var-decl name='interactive_src_start' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='73' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='interactive_src_end' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='76' column='1'/>
+        <var-decl name='interactive_src_end' type-id='type-id-17' visibility='default' filepath='Parser/lexer/state.h' line='74' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='end' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='77' column='1'/>
+        <var-decl name='end' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='75' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='78' column='1'/>
+        <var-decl name='start' type-id='type-id-6' visibility='default' filepath='Parser/lexer/state.h' line='76' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='done' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='79' column='1'/>
+        <var-decl name='done' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='77' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='fp' type-id='type-id-56' visibility='default' filepath='Parser/lexer/state.h' line='81' column='1'/>
+        <var-decl name='fp' type-id='type-id-56' visibility='default' filepath='Parser/lexer/state.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='tabsize' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='82' column='1'/>
+        <var-decl name='tabsize' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='672'>
-        <var-decl name='indent' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='83' column='1'/>
+        <var-decl name='indent' type-id='type-id-5' visibility='default' filepath='Parser/lexer/state.h' line='81' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='indstack' type-id='type-id-726' visibility='default' filepath='Parser/lexer/state.h' line='84' column='1'/>
